<p>Som s&#xE4;kert redan m&#xE4;rkts &#xE4;r jag en f&#xF6;respr&#xE5;kare av l&#xF6;sningar skrivna med &#xF6;ppen k&#xE4;llkod. <a href=http://openoffice.org>OpenOffice</a> &#xE4;r n&#xE5;got som jag anv&#xE4;nt sedan 2004 n&#xE4;r jag inledde mina studier vid universitet. Redan d&#xE5; var OpenOffice ett fullgott alternativ till Microsoft Word, d&#xE5; det hanterade Words filformat mycket bra. N&#xE5;gon g&#xE5;ng n&#xE4;r universitetets riktigt &#xF6;verambiti&#xF6;sa mallar best&#xE5;ende av sjuttioelva tusen Wordmacron kunde det bli litet knasigt n&#xE4;r filerna &#xF6;ppnades, men det tog aldrig l&#xE4;ngre &#xE4;n n&#xE5;gon minut att korrigera r&#xE4;tt igen d&#xE5; OpenOffice alltid hade motsvarande macron implementerade.</p><p>2005 blev jag med tolvtummaren PowerBook och d&#xE4;rmed Macanv&#xE4;ndare tills vidare, och flyttade &#xF6;ver all verksamhet i studierna till min Mac. Dessv&#xE4;rre st&#xF6;tte jag p&#xE5; patrull, d&#xE5; d&#xE5;varande OpenOffice inte kunde k&#xF6;ras i Mac OS X utan Xserver (ett till&#xE4;gg f&#xF6;r att k&#xF6;ra linuxprogram p&#xE5; Mac). Hur g&#xE4;rna jag &#xE4;n ville k&#xE4;nde jag mig inte bekv&#xE4;m med det, och jag ins&#xE5;g att situationen var oh&#xE5;llbar. Jag hade ingen lust att punga ut eller piratkopiera Microsoft Office, s&#xE4;rskilt inte till Macen. Lyckligtvis fanns <a href=http://www.neooffice.org/neojava/en/index.php>NeoOffice</a>, ett dotterprojekt till OpenOffice anpassat f&#xF6;r Mac OS X.</p><p>NeoOffice var trevligt och anv&#xE4;ndbart, men irriterade mig varje g&#xE5;ng jag startade det. Utvecklarna av projektet tycker att det &#xE4;r en j&#xE4;ttebra id&#xE9; att trycka upp en webbplats i nyllet p&#xE5; anv&#xE4;ndarna varje uppstart, och med tiden b&#xF6;rjde jag undvika att ens r&#xF6;ra office-dokument av den anledningen.</p><p>Och nyligen har <a href=http://www.openoffice.org/dev_docs/features/3.0/ >OpenOffice 3 med Mac OS X st&#xF6;d</a> lanserats.</p><blockquote><p>With Version 3.0, OpenOffice.org is now able to run on Mac OS X without the need for X11. Thus, OpenOffice.org behaves like any other Aqua application. The cool thing is, while the market leading office suite vendor dropped VBA support and the Solver feature, OpenOffice.org recently introduced limited VBA support and includes a powerful Solver component. In addition, OpenOffice.org integrates well with the Mac OS X accessibility APIs, and thus offers better accessibility support than many other Mac OS X applications. Finally, people like OpenOffice.org 3.0 for Mac OS X because of its very good stability and performance. Reportedly, some Mac users have switched to OpenOffice.org just because of its extremely good stability.</p></blockquote><p>Tack OpenOffice, nu &#xE5;ker den bleka kopian ut!</p>