<p>L&#xE4;nken <a href=http://www.microsoft.com/windows/internet-explorer/get-the-facts/browser-comparison.aspx>Windows Internet Explorer 8: Get the facts</a> &#xE4;r nog den roligaste p&#xE5; l&#xE4;nge. Den g&#xE5;r igenom n&#xE5;gra punkter d&#xE4;r Microsoft h&#xE4;vdar att IE8 &#xE4;ger Firefox och Chrome.</p><p>Inte nog med att de har totalt fel p&#xE5; vissa punkter, det &#xE4;r dessutom s&#xE5; uppenbara fel att alla gr&#xE4;nssnittsutvecklare och datatekniker vet hur totalt fel felen &#xE4;r. Jag k&#xE4;nner f&#xF6;r att kommentera h&#xE4;r.</p><h2 id=skerhet>S&#xE4;kerhet<a class=anchor href=#skerhet>&#xB6;</a></h2><blockquote><p>Internet Explorer 8 takes the cake with better phishing and malware protection, as well as protection from emerging threats.</p></blockquote><p>Nu &#xE4;r jag l&#xE5;ngt ifr&#xE5;n en expert p&#xE5; s&#xE4;kerhet, men jag har sv&#xE5;rt att tro att frist&#xE5;ende applikationer &#xE4;r mindre s&#xE4;kra &#xE4;n en applikation h&#xE5;rt integrerad med operativsystemet. K&#xE4;nns som f&#xE5;nigt s&#xE4;ljsnack.</p><h2 id=integritet>Integritet<a class=anchor href=#integritet>&#xB6;</a></h2><blockquote><p>InPrivate Browsing and InPrivate Filtering help Internet Explorer 8 claim privacy victory.</p></blockquote><p>Firefox har f&#xF6;rvisso inte den h&#xE4;r egenskapen i stable f&#xF6;rr&#xE4;n <a href=http://www.mozilla.com/en-US/firefox/3.5/releasenotes/ title="Firefox 3.5 rc1">3.5</a>, men vad jag vet hade Chrome detta redan h&#xF6;sten 2008, allts&#xE5; ett halv&#xE5;r innan IE8. Att p&#xE5;st&#xE5; att IE8 &#xE4;r unikt med detta &#xE4;r med andra ord rent struntprat.</p><h2 id=enkel-att-anvnda>Enkel att anv&#xE4;nda<a class=anchor href=#enkel-att-anvnda>&#xB6;</a></h2><blockquote><p>Features like Accelerators, Web Slices and Visual Search Suggestions make Internet Explorer 8 easiest to use.</p></blockquote><p>Oj, oj, oj. Var ska jag starta h&#xE4;r?</p><ul><li>IE8 <a href=http://www.456bereastreet.com/archive/200902/ie_8_still_does_not_resize_text_sized_in_pixels/ title="IE 8 still does not resize text sized in pixels">f&#xF6;rstorar inte text vars storlek &#xE4;r angiven i pixlar</a>.</li><li>IE8 f&#xF6;rs&#xF6;ker hitta 404:or i 10-15 sekunder innan den s&#xE4;ger n&#xE5;got.</li><li>IE8 kr&#xE4;ver http:// n&#xE4;r en annan port &#xE4;n 80 anv&#xE4;nds, tex example.com:8080.</li><li>Adressf&#xE4;ltet &#xE4;r i &#xF6;vrigt mycket dumt och gammmalmodigt i j&#xE4;mf&#xF6;relse med Chrome och Firefox.</li></ul><p>Men visst, gammal elller kopierad funktionalitet med nya &#xF6;verdrivet exotiska namn g&#xF6;r det f&#xF6;rmodligen litet mindre besv&#xE4;rligt.</p><h2 id=webbstandarder>Webbstandarder<a class=anchor href=#webbstandarder>&#xB6;</a></h2><blockquote><p>It&apos;s a tie. Internet Explorer 8 passes more of the World Wide Web Consortium&apos;s CSS 2.1 test cases than any other browser, but Firefox 3 has more support for some evolving standards.</p></blockquote><p>... and so does Chrome, even more than Firefox. Jag medger att IE8 har bra support f&#xF6;r webbstandards, men jag betvivlar att de har b&#xE4;st st&#xF6;d med tanke p&#xE5; <a href=http://teddyzetterlund.com/2009/04/16/internet-explorer-8-fieldset-and-legend-bugs/ title="Internet Explorer 8 fieldset and legend bugs">hur fel IE8 tolkar fieldsets</a> och att <a href=http://edskes.net/ie8overflowandexpandingboxbugs.htm title="IE8 overflow and expanding box bugs">IE8 har problem med overflow</a>.</p><p>St&#xF6;det f&#xF6;r JavaScript &#xE4;r fortfarande en katastrof, men det &#xE4;r &#xE5;as inte under W3C:s kontroll. S&#xE4;rskilt <a href=http://robertnyman.com/2008/11/04/internet-explorer-8-fix-event-handling-or-dont-release-it/ >Internet Explorer 8 - fix event handling, or don&apos;t release it</a> b&#xF6;r vara intressant l&#xE4;sning.</p><h2 id=utvecklingsverktyg>Utvecklingsverktyg<a class=anchor href=#utvecklingsverktyg>&#xB6;</a></h2><blockquote><p>Of course Internet Explorer 8 wins this one. There&apos;s no need to install tools separately, and it offers better features like JavaScript profiling.</p></blockquote><p>Min egen &#xE5;sikt: allvarligt talat? Utvecklingsverktygen i IE8 &#xE4;r en <em>katastrof</em>. Odugligt, sv&#xE5;rt att anv&#xE4;nda och om&#xF6;jliga att hitta i. Det finns kompetenta verktyg som kostar slantar och som ocks&#xE5; kr&#xE4;ver egen installation. Dessa &#xE4;r dock bleka i j&#xE4;mf&#xF6;relse med s&#xE5;v&#xE4;l Chromes som Firefox varianter.</p><h2 id=kompabilitet>Kompabilitet<a class=anchor href=#kompabilitet>&#xB6;</a></h2><blockquote><p>Internet Explorer 8 is more compatible with more sites on the Internet than any other browser.</p></blockquote><p>H&#xE4;r s&#xE4;ger jag att det &#xE4;r tur f&#xF6;r Microsoft att kunder tvingar designers att l&#xE4;gga ner extra tid f&#xF6;r att f&#xE5; det att fungera i IE. Skulle alla bl&#xE5;neka den tiden skulle de aldrig v&#xE5;ga g&#xE5; ut med det h&#xE4;r.</p><p>Att vara erbjuda bak&#xE5;tkompabilitet med hemsidor byggda 1994 &#xE4;r inget att vara stolt &#xF6;ver. Att erbjuda ett verktyg f&#xF6;r att ge alla omoderna tekniker f&#xF6;rdel mot de moderna och rekommenderade (<a href="http://www.google.se/search?q=version+targeting&amp;ie=utf-8&amp;oe=utf-8&amp;aq=t&amp;rls=org.mozilla:en-US:official&amp;client=firefox-a">Version targeting</a>) &#xE4;r inte heller n&#xE5;got att vara stolt &#xF6;ver. Att fortfarande ligga efter andra webbl&#xE4;sare med flertalet &#xE5;r &#xE4;r v&#xE4;rt att sk&#xE4;mmas f&#xF6;r.</p><h2 id=plitlighet>P&#xE5;litlighet<a class=anchor href=#plitlighet>&#xB6;</a></h2><blockquote><p>Only Internet Explorer 8 has both tab isolation and crash recovery features; Firefox and Chrome have one or the other.</p></blockquote><p>Det &#xE4;r en mycket vinklad sanning. Chrome var ffs f&#xF6;rst med tab isolation i stable version (IE8 hade det i beta1 som f&#xF6;rvisso kom f&#xF6;re Chrome, men som i b&#xE4;sta fall kunde kallas alfa: l&#xE4;s <a href=http://en.wikipedia.org/wiki/Beta_version#Beta title="Software release life cycle">definition av beta</a>). Firefox har tagit tid p&#xE5; sig f&#xF6;r att skapa tab isolation, men kommer att ha det i stable i sommar n&#xE4;r 3.5 &#xE4;r redo. Crash recoveryn p&#xE5; Firefox har varit uttalad standard sedan version 2.0. S&#xE5; IE8 kopierade styrkor fr&#xE5;n tv&#xE5; Open Source-projekt och f&#xF6;rs&#xF6;ker s&#xE4;lja det som n&#xE5;got nytt och unikt.</p><h2 id=instllningsbarhet>Inst&#xE4;llningsbarhet<a class=anchor href=#instllningsbarhet>&#xB6;</a></h2><blockquote><p>Sure, Firefox may win in sheer number of add-ons, but many of the customizations you&apos;d want to download for Firefox are already a part of Internet Explorer 8 -- right out of the box.</p></blockquote><p>Firefox styrka &#xE4;r dess addons. Det &#xE4;r som att s&#xE4;ga att en bil har s&#xE4;mre flytf&#xF6;rm&#xE5;ga &#xE4;n en b&#xE5;t f&#xF6;r att den inte &#xE4;r tillverkat i f&#xF6;r tungt material. Chrome l&#xE5;ter jag vara osagt, annat &#xE4;n att jag inte hittat n&#xE5;got i IE8 som inte redan finns i Chrome.</p><h2 id=handhavandemjligheter>Handhavandem&#xF6;jligheter<a class=anchor href=#handhavandemjligheter>&#xB6;</a></h2><blockquote><p>Neither Firefox nor Chrome provide guidance or enterprise tools. That&apos;s just not nice.</p></blockquote><p>H&#xE4;r f&#xF6;rst&#xE5;r jag ingenting. Vad menar Microsoft? Sedan n&#xE4;r beh&#xF6;ver en webbl&#xE4;sare &quot;Enterprise tools&quot;? Vad&#xE5; &quot;guideance&quot;? beh&#xF6;vs hj&#xE4;lp och assistans f&#xF6;r att surfa &#xE4;r det ett konstruktionsfel snarare &#xE4;n en feature.</p><h2 id=prestanda>Prestanda<a class=anchor href=#prestanda>&#xB6;</a></h2><blockquote><p>Knowing the top speed of a car doesn&apos;t tell you how fast you can drive in rush hour. To actually see the difference in page loads between all three browsers, you need slow-motion video. This one&apos;s also a tie.</p></blockquote><p>F&#xF6;rbannad l&#xF6;gn. Det finns charts som visar att IE8 &#xE4;r likv&#xE4;rdig eller snabbare vid sidladdning, men vid h&#xE5;rd profilering av script ligger IE fortfarande hoppl&#xF6;st efter Chrome och Firefox.</p><p>Jag har sj&#xE4;lv jobbat med profilering och konstaterat att IE7 &#xE4;r 10 g&#xE5;nger s&#xE5; l&#xE5;ngsam, och IE8 &#xE4;r b&#xE4;ttre - ungef&#xE4;r <em>bara</em> 2 g&#xE5;nger s&#xE5; l&#xE5;ngsam. (Mer om detta kommer i kommande bloggposter d&#xE5; jag jobbar med litet script f&#xF6;r det h&#xE4;r). IE8 har ocks&#xE5; som sina f&#xF6;reg&#xE5;ngare stora problem med att inte h&#xE4;nga sig vid javascript-exekvering. Det g&#xE5;r att med tidtagarur m&#xE4;ta hur l&#xE5;ng tid det tar att exekvera vissa script. Det beh&#xF6;vs ingen slow-motion.</p><p>Sammanfattningsvis: jag skrattar. Ordentligt. Som en sista spik i kistan kan s&#xE4;gas att om IE8 <em>hade</em> gl&#xE4;nst &#xF6;ver Firefox och Chrome, s&#xE5; hade vi beh&#xF6;vt v&#xE4;nta i m&#xE5;nga &#xE5;r f&#xF6;r att bli av med IE7 och IE6. Det finns till och med teorier om att <a href=http://www.quirksmode.org/blog/archives/2009/06/state_of_the_br_1.html title="State of the Browsers &#x2014; IE edition">IE6 kommer att &#xF6;verleva IE7</a>. Med andra ord: IE8 har redan f&#xF6;rlorat, oavsett resultat.</p><p>Uppdatering</p><p>Jag bifogar nedan ett profileringstest d&#xE4;r jag k&#xF6;r tre for-loopar i olika utf&#xF6;randen. Mer om detalj finns testets sida <a href="http://madr.se/~ay/labs/app/jstester/?file=loops.xml">Loop performance</a>. Ordningen p&#xE5; bilden: IE8, Chrome, Firefox.</p><p>Samma funktioner p&#xE5; alla tre webbl&#xE4;sare. IE8 <em>p&#xE5;tagligt</em> l&#xE5;ngsammare under Windows XP Home p&#xE5; en dator fr&#xE5;n tidigt 2009. Talar sitt tydliga spr&#xE5;k.</p>