<p>Robert Nyman har slagkraftigt bett Microsoft och <a href=http://blogs.msdn.com/ie/ >IETeamet</a> att <a href=http://www.robertnyman.com/2008/11/04/internet-explorer-8-fix-event-handling-or-dont-release-it/ title="Internet Explorer 8 - fix event handling, or don&#x2019;t release it">strunta i att sl&#xE4;ppa ie8</a> om de inte g&#xF6;r n&#xE5;got &#xE5;t h&#xE4;ndelsehanteringen i sin webbl&#xE4;sare. Jag h&#xE5;ller med honom, d&#xE5; jag sj&#xE4;lv precis som Nyman g&#xE4;rna skriver JavaScript utan bibliotek om jag kan, och d&#xE4;rmed st&#xF6;ter p&#xE5; patrull n&#xE4;r det kommer till hantering av h&#xE4;ndelser. Jag f&#xF6;resl&#xE5;r att l&#xE4;nken f&#xF6;ljs och l&#xE4;ses innan resten av detta inl&#xE4;gg l&#xE4;ses.</p><ul><li>Det finns bara en enda <em>global</em> h&#xE4;ndelse, ist&#xE4;llet f&#xF6;r en <em>lokal</em> referens per h&#xE4;ndelse. Ist&#xE4;llet f&#xF6;r separat hantering f&#xF6;r tangentbordsh&#xE4;ndelser, mush&#xE4;ndelser och sidh&#xE4;ndelser landar allt i en enda referens, med det senaste f&#xF6;rst, utan stack eller k&#xF6;.</li><li>Nyckelordet <code>this</code> pekar p&#xE5; <code>window</code> och inte det aktuella elementet, t ex l&#xE4;nken som klickats eller bilden som registrerar musr&#xF6;relser.</li><li>Ingen <a href=http://www.quirksmode.org/js/events_order.html>capture phase, bara bubbling</a>. Detta &#xE4;r att nekas en mycket, mycket stark feature i JavaScript som programmeringsspr&#xE5;k.</li><li>Annan syntax: <code>onclick</code> ist&#xE4;llet f&#xF6;r <code>click</code>, <code>onmouseover</code> ist&#xE4;llet f&#xF6;r <code>mouseover</code> ...</li></ul><p>IE:s h&#xE4;ndelsehantering har best&#xE5;tt sedan IE5, i cirka tio &#xE5;r. W3C tog fram en standardiserad modell, byggd p&#xE5; Netscapes modell kring millenieskiftet. Den senare &#xE4;r idag implementerad i <a href=http://getfirefox.com>Firefox</a>, <a href=http://apple.com/se/safari>Safari</a>, <a href=http://google.com/chrome>Chrome</a> och <a href=http://opera.com>Opera</a>. Den uteblev dock i IE6 (2001), och &#xE4;ven ur IE7(2006). I de f&#xF6;rsta fallet ar det f&#xF6;r n&#xE4;ra inp&#xE5;, kan man tro. I andra fallet var det prioritet p&#xE5; CSS-buggar som tog &#xF6;verhanden. Men att strunta i h&#xE4;ndelsehanteringen f&#xF6;r IE8, som uttryckligen ska prioritera <em>JavaScriptrelaterade buggar och problem</em> &#xE4;r verkligen of&#xF6;rl&#xE5;tligt.</p><p>Det borde inte vara n&#xE5;gon om&#xF6;jlighet, med Microsofts budget och kompetenta anst&#xE4;llda att skapa st&#xF6;d f&#xF6;r W3C-hanteringen och samtidigt vara bak&#xE5;tkompatibel med den IE-specifika hanteringen.</p><p>Jag s&#xE4;ger: <strong>Jag accepterar det inte, IETeamet m&#xE5;ste fixa detta!</strong> H&#xE5;ller ni med? Blogga om det, skriv om det i kommentarer, g&#xF6;r er r&#xF6;st h&#xF6;rda. Microsoft har &#xE4;ndrat sig f&#xF6;rut (t&#xE4;nk p&#xE5; <a href=http://www.webstandards.org/2008/01/22/microsofts-version-targeting-proposal/ title="Microsoft&#x2019;s Version Targeting Proposal">Version targeting hyserin</a> i v&#xE5;ras), s&#xE5; det &#xE4;r dags f&#xF6;r oss utvecklare att s&#xE4;tta ner foten!</p>