<p>Designf&#xF6;r&#xE4;ndringar: synliga skippl&#xE4;nkar Uppdateringar har skett i HTML-koden. Bland annat &#xE4;r de tidigare osynliga skippl&#xE4;nkarna synliga.</p><p>Idag valde jag att &#xE4;ndra i min HTML-kod av diverse sk&#xE4;l. Jag har l&#xE4;nge funderat p&#xE5; att g&#xF6;ra detta, men inte funnit motivationen d&#xE5; det egentligen inte &#xE4;r n&#xE5;gon stor grej, och &#xE4;nnu mindre troligt n&#xE5;gon annan &#xE4;n jag sj&#xE4;lv bryr mig om.</p><h2 id=innehllet-har-flyttats-ner>Inneh&#xE5;llet har flyttats ner<a class=anchor href=#innehllet-har-flyttats-ner>&#xB6;</a></h2><p>Jag var en riktig kodnazist n&#xE4;r jag sist reviderade HTML-koden. Jag best&#xE4;mde mig f&#xF6;r att k&#xF6;ra med inneh&#xE5;ll f&#xF6;rst till vilket pris som helst. Det &#xE4;r god sed f&#xF6;r uppm&#xE4;rkning att ha inneh&#xE5;llet s&#xE5; tidigt som m&#xF6;jligt i HTML-dokumentet, men leder till problem n&#xE4;r det g&#xE4;ller till att hitta p&#xE5; smidiga CSS-l&#xF6;sningar - d&#xE5; navigationen tenderar till att alltid vara &#xF6;verst eller komma f&#xF6;rst p&#xE5; en webbplats.</p><p>M&#xE5;nga utav mina f&#xF6;rebilder, s&#xE5;som <a href=http://456bereastreet.com title="456 Berea Street">Roger Johansson</a>, <a href=http://robertnyman.com>Robert Nyman</a> och <a href=http://friendlybit.com title=Friendlybit>Emil Stenstr&#xF6;m</a> har inte denna kodkonvention. Dessa k&#xF6;r alla med navigationen &#xF6;ver inneh&#xE5;llet. Faktum &#xE4;r att ytterst f&#xE5; v&#xE4;ljer att strukturera sin kod p&#xE5; det viset. Jag har d&#xE4;rf&#xF6;r dragit slutsatsen att det &#xE4;r bra, men r&#xE4;tt overkill att inte g&#xF6;ra p&#xE5; det viset. S&#xE5; jag gick allts&#xE5; fr&#xE5;n</p><ol><li><code>&lt;ul id=&quot;skip&quot;&gt;</code></li><li><code>&lt;li&gt;</code></li><li><code>Till navigationen</code></li><li><code>&lt;/li&gt;</code></li><li><code>[...]</code></li><li><code>&lt;/ul&gt;</code></li><li><code></code></li><li><code>&lt;div id=&quot;content&quot;&gt;</code></li><li><code>[...]</code></li><li><code>&lt;/div&gt;</code></li><li><code></code></li><li><code>&lt;div id=&quot;nav&quot;&gt;</code></li><li><code>[...]</code></li><li><code>&lt;/div&gt;</code></li></ol><p>Till f&#xF6;ljande:</p><ol><li><code>&lt;ul id=&quot;skip&quot;&gt;</code></li><li><code>&lt;li&gt;</code></li><li><code>Till inneh&#xE5;llet</code></li><li><code>&lt;/li&gt;</code></li><li><code>[...]</code></li><li><code>&lt;/ul/&gt;</code></li><li><code></code></li><li><code>&lt;div id=&quot;nav&quot;&gt;</code></li><li><code>[...]</code></li><li><code>&lt;/div&gt;</code></li><li><code></code></li><li><code>&lt;div id=&quot;content&quot;&gt;</code></li><li><code>[...]</code></li><li><code>&lt;/div&gt;</code></li></ol><p>Det skall bli sp&#xE4;nnande att se om jag f&#xE5;r n&#xE5;gra biverkningar p&#xE5; grund av mitt val.</p><h2 id=g-till-innehllet>G&#xE5; till inneh&#xE5;llet<a class=anchor href=#g-till-innehllet>&#xB6;</a></h2><p>S&#xE5; vad om min nya balk med en massa tuffa l&#xE4;nkar?</p><p>Skippl&#xE4;nkar &#xE4;r till f&#xF6;r det strukturella och spelar viss roll ur SEO-synpunkt. Det &#xE4;r inte n&#xF6;dv&#xE4;ndigt att visa dem annat &#xE4;n f&#xF6;r de som <em>skall se dem</em>, s&#xE5;som s&#xF6;kmotorspindlar eller sk&#xE4;rml&#xE4;sare. Jag har dock, likv&#xE4;l, valt att l&#xE4;gga mina skippl&#xE4;nkar synliga p&#xE5; sidan.</p><p>Det &#xE4;r ocks&#xE5; ett experiment f&#xF6;r att se om min <a href=http://en.wikipedia.org/wiki/PageRank>PageRank</a> p&#xE5;verkas av synliga eller osynliga skippl&#xE4;nkar eller omkastad ordning i min uppm&#xE4;rkning.</p>