<p><strong>Spoiler:</strong> Detta inl&#xE4;gg &#xE4;r ej politiskt korrekt. Jag ber om urs&#xE4;kt f&#xF6;r starkt spr&#xE5;k.</p><p>Jag var inte s&#xE4;rskilt &#xF6;vertygad av att IE8 klarade Acid2-testet. Likv&#xE4;l k&#xE4;nde jag ett svagt pirrande i magen av f&#xF6;rv&#xE4;ntning inf&#xF6;r IE8. Jag l&#xE4;t ett litet, mycket svagt hopp om en b&#xE4;ttre framtid i mitt yrke byggas upp. Och ikv&#xE4;ll f&#xF6;rsvann <em>allt</em> &#xE5;t helvete.</p><p>IE8 har en ny &quot;feature&quot; som tar ner webbl&#xE4;sarsniffning p&#xE5; HTML-niv&#xE5; ytterligare en g&#xE5;ng (Conditional comments &#xE4;r dess f&#xF6;reg&#xE5;ngare). F&#xF6;r alla standardsmedvetna HTML-dokument som inte har det <code>meta</code>element som sk&#xF6;ter sniffandet kommer IE8 att nedgradera sin renderingsmotor till IE7. Detta inneb&#xE4;r att det s&#xE5; efterl&#xE4;ngtande standardsst&#xF6;det i IE8 uteblir f&#xF6;r alla sidor som <em>f&#xF6;ljer</em> standarder.</p><p>Motiveringen f&#xF6;r detta nya &quot;superstandardsl&#xE4;get&quot;, som det kommit att kallas, kan sammanfattas genom den h&#xE4;r korta historiken.</p><ol><li>Lama urs&#xE4;kter till webbutvecklare (LUW) bygger d&#xE5;liga hemsidor, d&#xE5;lig som i &quot;standards &#xE4;r jobbigt&quot;.</li><li>N&#xE5;gra LUW gjorde l&#xE4;xan, blev Seri&#xF6;sa webbutvecklare och byggde korrekta hemsidor. N&#xE5;gra LUW fortsatte som f&#xF6;rut, d&#xE5; de inte ans&#xE5;g att de hade n&#xE5;got ansvar.</li><li>Webbl&#xE4;sare ville leka f&#xF6;rl&#xE5;tande bl&#xE5;&#xF6;gd curlingf&#xF6;r&#xE4;lder, utryckte &quot;alla skall med!&quot; och skapade tv&#xE5; visningsl&#xE4;gen: <em>Standardl&#xE4;ge</em>, d&#xE4;r de seri&#xF6;sa webbutvecklarnas hemsidor visades, och <em>Quirksl&#xE4;get</em>, som gjorde att LUW fick en urs&#xE4;kt att forts&#xE4;tta misshandla Internet med sitt skr&#xE4;p.</li><li>V&#xE4;rldens st&#xF6;rsta webbl&#xE4;sare tillgodoser webbutvecklare med ett standardsl&#xE4;ge som suger kuk.</li><li>Det kukiga standardsl&#xE4;get blir stillast&#xE5;ende i <em>sex</em> &#xE5;r.</li><li>De seri&#xF6;sa webbutvecklarna hittar nya v&#xE4;gar. En <em>majoritet</em> av de seri&#xF6;sa webbutvecklarna v&#xE4;ljer att ta det kukiga standardl&#xE4;get som enda referens vid nyutveckling och blir d&#xE4;rmed LUW. Somliga vet b&#xE4;ttre och blir webbstandardsadvokater, WSA. Tidigare LUW lever i ignorans och pillar navelludd.</li><li>V&#xE4;rldens st&#xF6;rsta webbl&#xE4;sare sl&#xE4;pper ett nytt standardsl&#xE4;ge som <em>n&#xE4;stan</em> f&#xF6;ljer standarden.</li><li>De nyare LUW:s hemsidor sedan sex &#xE5;r tillbaka kraschar skoningsl&#xF6;st, LUW:s inser inte varf&#xF6;r. &#xC4;ldre LUW:s pillar fortfarande navelludd i quirkl&#xE4;get.</li><li>WSA &#xE4;r lika l&#xE5;sta som f&#xF6;rut, och b&#xF6;rjar tappa t&#xE5;lamodet.</li></ol><p>N&#xE4;r IE8 klarade Acid2, trodde jag att WSA som utst&#xE5;tt s&#xE5;dant el&#xE4;nde s&#xE5; l&#xE4;nge skulle f&#xE5; uppr&#xE4;ttelse. LUW:ar skulle tvingas in p&#xE5; r&#xE4;tt sp&#xE5;r f&#xF6;r att f&#xE5; k&#xF6;ra standardsl&#xE4;ge, eller v&#xE4;lja att g&#xE5; till quirksl&#xE4;ge.</p><p>IE8 spottar ist&#xE4;llet alla WSA i ansiktet och ger LUW en urs&#xE4;kt att forts&#xE4;tta skriva skitkod.</p><p>Det v&#xE4;rsta &#xE4;r dock att m&#xE5;nga WSA tycker att det hela &#xE4;r en j&#xE4;ttebra id&#xE9;, och vill se att liknande funktionalitet skall inf&#xF6;ras hos &#xF6;vriga webbl&#xE4;sare.</p><p>Utvecklarna f&#xF6;r Gecko, Presto och WebKit kommer att g&#xF6;ra det samma natt som det st&#xE5;r klart att en majoritet vill ha det. Det &#xE4;r s&#xE5; dessa fungerar: vad folk vill ha, utvecklar dem. Och det fort.</p><p>Det g&#xF6;r verkligen ont. Varf&#xF6;r skall LUW f&#xE5; f&#xF6;rbli d&#xE5;liga webbutvecklare, samtidigt som WSA m&#xE5;ste anpassa sig? Det borde vara tv&#xE4;rtom.</p><p>Det &#xE4;r or&#xE4;ttvist.</p><p>Vidare l&#xE4;sning</p><ul><li><a href=http://blogs.msdn.com/ie/archive/2008/01/21/compatibility-and-ie8.aspx>Compatibility and IE8</a></li><li><a href=http://alistapart.com/articles/beyonddoctype>Beyond DOCTYPE: Web Standards, Forward Compatibility, and IE8</a></li><li><a href=http://snook.ca/archives/browsers/version_targeting_ie8/ >IE8 to include version targeting</a></li></ul>