<p>Kring millenieskiftet startades en v&#xE5;g av nyt&#xE4;nding f&#xF6;r Tolkiens b&#xF6;cker och fantasy rent allm&#xE4;nt, i och med att folk vakade inf&#xF6;r filmernas premi&#xE4;rer. Filmatiseringen gjorde att ett behov av en m&#xF6;tesplats, d&#xE4;r nyfr&#xE4;lsta Sagan om Ringen-fantaster, men ocks&#xE5; fantasyintresserade i allm&#xE4;nhet, kunde tr&#xE4;ffa annat folk med samma nyvunna intresse.</p><p>Det var i denna v&#xE5;gtopp som <a href=http://catahya.net>Catahya</a> lanserades, och fick explosivartat stor genomslagskraft. Catahya, som var ett initiativ av det g&#xE4;ng som drivit Kortirion.net och som utvecklades av personer som tidigare f&#xF6;rvaltat egna likartade projekt, blev och &#xE4;r fortfarande den fr&#xE4;msta svenska m&#xF6;tesplatsen f&#xF6;r fantasyintresset. Men det som Catahya aldrig lyckades med var att skapa en best&#xE5;ende, stens&#xE4;ker Tolkieninriktning.</p><p>Och nu h&#xE4;nder samma sak igen ...</p><p>The Hobbit skall allts&#xE5; bli film. Peter Jackson styr och st&#xE4;ller igen. Dessutom blir det <em>tv&#xE5;</em> filmer. Min gissning &#xE4;r att premi&#xE4;rerna knappast l&#xE4;r ligga t&#xE4;tare inp&#xE5; varandra &#xE4;n tolv m&#xE5;nader. Detta g&#xF6;r att personer fr&#xE4;lsta av den f&#xF6;rsta filmen kommer finna ett behov av en m&#xF6;tesplats d&#xE4;r de kan g&#xF6;ra v&#xE4;ntan uth&#xE4;rdlig.</p><p>Fr&#xE5;gan &#xE4;r vem som kommer att ta p&#xE5; sig rollen att tillfredsst&#xE4;lla behovet.</p><p>Catahya har st&#xF6;rst spridning, men har en alltf&#xF6;r allm&#xE4;n inriktning f&#xF6;r att tillfredsst&#xE4;lla detta mycket speciella behov.</p><p><a href=http://tolkiensarda.se>Tolkiens Arda</a> har spetskompetens p&#xE5; allt som r&#xF6;r Tolkien, men inte lika stor spridning som Catahya.</p><p>Hur skulle ett samarbete se ut?</p><p>Om Catahya och Tolkiens Arda gick ihop och skapade denna sida om filmatiseringen av The Hobbit - s&#xE4;g med nyhetsrapportering, forum och litet annat portalgrejs, skulle resultatet bli bra? Jag tror faktiskt det. Tolkiens Arda har eldsj&#xE4;larna, de som kan och vill, samtidigt som Catahya skulle se till att <em>alla</em> skulle bli upplysta om sidan.</p><p>Vem g&#xF6;r det annars?</p><p>Det var l&#xE4;nge sedan man fick nys om en nystartad sida om fantasy. Kommer ett generationsskifte nu, d&#xE4;r unga, pigga och of&#xF6;rst&#xF6;rda beg&#xE5;vningar tr&#xE4;der fram och ger alla som f&#xF6;r&#xE4;lskar sig i The Hobbit vad de vill ha?</p><p>Vi f&#xE5;r se.</p>