<?xml version="1.0" encoding="utf-8" standalone="no"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <id>https://madr.se/</id>
  <link href="https://madr.se/"/>
  <link href="https://madr.se/prenumerera.xml" rel="self"/>
  <title>madr.se</title>
  <subtitle>Anders Ytterström om hårdrock, musik och webbutveckling</subtitle>
  <updated>2020-01-01T23:58:26.439Z</updated>
  <entry>
    <title>Tack för tiden, Facebook och LinkedIn</title>
    <id>https://madr.se/2019/facebook-linkedin-eol</id>
    <link href="https://madr.se/2019/facebook-linkedin-eol"/>
    <updated>2019-11-26T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;I mitt intresse f&amp;#xF6;r webb och teknik har jag ofta varit f&amp;#xF6;rst eller &amp;#xE5;tminstone tidig med att haka p&amp;#xE5; nytt. Jag uppskattar nya s&amp;#xE4;tt som ger mig m&amp;#xF6;jlighet att utbyta id&amp;#xE9;er och gillande inst&amp;#xE4;mmanden fr&amp;#xE5;n folk som &amp;#xE4;r lika konstiga och kn&amp;#xE4;ppa som jag &amp;#xE4;r. Sociala medier var inget undantag n&amp;#xE4;r dessa blev popul&amp;#xE4;ra i slutet av 00-talet.&lt;/p&gt;
&lt;p&gt;Jag har sedan dess tappat tron p&amp;#xE5; sociala medier, och vill d&amp;#xE4;rf&amp;#xF6;r inte ge mer personlig data till stora f&amp;#xF6;retag och d&amp;#xE4;rmed bli en produkt. Min tid ska ist&amp;#xE4;llet till&amp;#xE4;gnas &amp;#xE5;t att teckna, l&amp;#xE4;sa och att s&amp;#xE5;v&amp;#xE4;l lyssna som skapa musik.&lt;/p&gt;
&lt;p&gt;Av denna anledning tog jag bort Twitter och Instagram under v&amp;#xE5;ren 2018, med &lt;a href="../../2018/twitter-instagram-eol/"&gt;en liten motivering&lt;/a&gt;.&lt;/p&gt;
&lt;h2 id="dags-igen-facebook-och-linkedin"&gt;Dags igen: Facebook och LinkedIn&lt;a class="anchor" href="#dags-igen-facebook-och-linkedin"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;Jag tar nu ocks&amp;#xE5; bort mina konton p&amp;#xE5; Facebook och LinkedIn i januari.&lt;/p&gt;
&lt;p&gt;Facebook har jag haft sedan augusti 2007. Jag har experimenterat med det sociala mediet n&amp;#xE5;gra g&amp;#xE5;nger, bl a genom att ta bort alla v&amp;#xE4;nner och att inaktivera kontot. Sedan h&amp;#xF6;sten 2016 har jag anv&amp;#xE4;nt Facebook enbart som evenemangskalender, d&amp;#xE4;r jag kan konstatera att tre &amp;#xE5;rs algoritm-matande inte har hj&amp;#xE4;lpt Facebook att visa mig relevanta evenemang. Detta ser jag som klart underk&amp;#xE4;nt, och jag har d&amp;#xE4;rf&amp;#xF6;r ingen anledning stark nog att motivera mig att ha kvar detta konto.&lt;/p&gt;
&lt;p&gt;LinkedIn har jag haft sedan 2008, och f&amp;#xF6;r varje &amp;#xE5;r som g&amp;#xE5;tt har m&amp;#xE4;ngden kalla meddelanden fr&amp;#xE5;n rekryterare stadigt &amp;#xF6;kat. Detta trots att jag inte har uttryckt att jag skulle vara intresserad av s&amp;#xE5;dant. Jag har haft en bild av att LinkedIn skulle vara viktigt f&amp;#xF6;r synlighet proffessionellt, men har kommit p&amp;#xE5; andra tankar. Jag t&amp;#xE4;nker att LinkedIn inte ers&amp;#xE4;tter ett &amp;quot;riktigt&amp;quot; CV, och att h&amp;#xF6;rs&amp;#xE4;gen f&amp;#xF6;rmodligen inte p&amp;#xE5;verkas av det s&amp;#xE5; v&amp;#xE4;rst mycket alls.&lt;/p&gt;
&lt;h2 id="tips-exportera-din-data-innan-kontona-tas-bort"&gt;Tips: exportera din data innan kontona tas bort&lt;a class="anchor" href="#tips-exportera-din-data-innan-kontona-tas-bort"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;F&amp;#xF6;r alla som g&amp;#xE5;r i liknande tankar har jag ett tips: &lt;strong&gt;exportera din data f&amp;#xF6;rst&lt;/strong&gt;. Den &amp;#xE4;r v&amp;#xE4;rd att beh&amp;#xE5;lla f&amp;#xF6;r minnenas skull. Brukligt i branchen har blivit att generera en zipfil med all data i HTML-format, vilket jag personligen uppskattar mycket.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href="https://www.facebook.com/help/1701730696756992"&gt;Hur du h&amp;#xE4;mtar hem all data fr&amp;#xE5;n Facebook&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.linkedin.com/help/linkedin/answer/66844/exporting-connections-from-linkedin?lang=en"&gt;Hur du h&amp;#xE4;mtar hem all data fr&amp;#xE5;n LinkedIn&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Detta g&amp;#xE5;r &amp;#xE4;ven att g&amp;#xF6;ra f&amp;#xF6;r &lt;a href="https://help.twitter.com/en/managing-your-account/how-to-download-your-twitter-archive"&gt;Twitter&lt;/a&gt; och &lt;a href="https://www.instagram.com/download/request/"&gt;Instagram&lt;/a&gt;.&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>Tack för tiden, Twitter och Instagram</title>
    <id>https://madr.se/2018/twitter-instagram-eol</id>
    <link href="https://madr.se/2018/twitter-instagram-eol"/>
    <updated>2018-04-07T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;I mitt intresse f&amp;#xF6;r webb och teknik har jag ofta varit f&amp;#xF6;rst eller &amp;#xE5;tminstone tidig med att haka p&amp;#xE5; nya s&amp;#xE4;tt som ger mig m&amp;#xF6;jlighet att utbyta id&amp;#xE9;er och gillande inst&amp;#xE4;mmanden fr&amp;#xE5;n folk som &amp;#xE4;r lika konstiga och kn&amp;#xE4;ppa som jag &amp;#xE4;r. Sociala medier var inget undantag n&amp;#xE4;r dessa blev popul&amp;#xE4;ra i slutet av 00-talet.&lt;/p&gt;
&lt;p&gt;Jag tog dock bort mitt Twitterkonto i mars, och mitt Instagramkonto i april. Facebook &amp;#xE4;r tills vidare kvar d&amp;#xE5; det finns v&amp;#xE4;rde. Mitt m&amp;#xE5;l &amp;#xE4;r att ist&amp;#xE4;llet b&amp;#xF6;rja publicera bilder, kortare videos och annat personligt h&amp;#xE4;r p&amp;#xE5; min hemsida ist&amp;#xE4;llet f&amp;#xF6;r i sociala n&amp;#xE4;tverk.&lt;/p&gt;
&lt;p&gt;Jag tror inte l&amp;#xE4;ngre p&amp;#xE5; sociala medier, och vill d&amp;#xE4;rf&amp;#xF6;r inte ge mer personlig data till stora f&amp;#xF6;retag och d&amp;#xE4;rmed bli en produkt. Min tid ska ist&amp;#xE4;llet till&amp;#xE4;gnas &amp;#xE5;t att teckna, l&amp;#xE4;sa och att s&amp;#xE5;v&amp;#xE4;l lyssna som skapa musik.&lt;/p&gt;
&lt;p&gt;Jag har &amp;#xE4;ven privata sk&amp;#xE4;l som jag har sv&amp;#xE5;rt att f&amp;#xF6;rklara i ord h&amp;#xE4;r. Det har med min f&amp;#xF6;rm&amp;#xE5;ga att l&amp;#xE4;gga alldeles f&amp;#xF6;r mycket tid och energi p&amp;#xE5; sociala n&amp;#xE4;tverk, med mycket l&amp;#xE5;g ROI. Jag blir helt enkelt mer produktiv, lugn och balanserad n&amp;#xE4;r jag inte har sociala fl&amp;#xF6;den att h&amp;#xE5;lla mig uppdaterad p&amp;#xE5;.&lt;/p&gt;
&lt;p&gt;Twitter anv&amp;#xE4;nde jag under tio &amp;#xE5;r (2008-2018). Jag fick d&amp;#xE4;r n&amp;#xE5;gra viktiga kontakter som gav min karri&amp;#xE4;r skjuts under tidigt 10-tal. De 3 senaste &amp;#xE5;ren d&amp;#xE4;r har dock varit en ned&amp;#xE5;tg&amp;#xE5;ende spiral, och min egen aktivitet hade helt avstannat.&lt;/p&gt;
&lt;p&gt;Instagram anv&amp;#xE4;nde jag under perioderna 2011-2012 och 2015-2018. P&amp;#xE5; Instagram s&amp;#xF6;kte jag fr&amp;#xE4;mst annat h&amp;#xE5;rdrocksfolk och kreat&amp;#xF6;rer, samt f&amp;#xF6;ljde viktiga personer i mitt liv. Mitt eget inneh&amp;#xE5;ll var en sorts bilddagbok, d&amp;#xE5; jag tycker det &amp;#xE4;r roligt att dokumentera vardagen p&amp;#xE5; det s&amp;#xE4;ttet.&lt;/p&gt;
&lt;p&gt;Det sistn&amp;#xE4;mnda &amp;#xE4;r n&amp;#xE5;got jag vill forts&amp;#xE4;tta med, s&amp;#xE5; jag har h&amp;#xE4;r ett ypperligt tillf&amp;#xE4;lle att koda n&amp;#xE5;got kul i Django, Flask eller Elixir. Det ger mig f&amp;#xF6;rmodligen ocks&amp;#xE5; anledning att anv&amp;#xE4;nda CSS-variabler och CSS Grids. Framf&amp;#xF6;rallt f&amp;#xE5;r jag &amp;#xE4;ga min egen data igen.&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>2017, året som gick</title>
    <id>https://madr.se/2017/2017</id>
    <link href="https://madr.se/2017/2017"/>
    <updated>2017-12-31T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;&amp;#xC4;nnu ett &amp;#xE5;r &amp;#xE4;r avslutat, varvid det &amp;#xE4;r l&amp;#xE4;gligt att skriva litet om de 12 m&amp;#xE5;nader som g&amp;#xE5;tt.&lt;/p&gt;
&lt;h2 id="tekniker-jag-lskat-under-ret"&gt;Tekniker jag &amp;#xE4;lskat under &amp;#xE5;ret&lt;a class="anchor" href="#tekniker-jag-lskat-under-ret"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;Trots att mycket h&amp;#xE4;nde under 2017 finns inte s&amp;#xE5; mycket att skriva om f&amp;#xF6;r teknik.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Django&lt;/strong&gt;. Nio m&amp;#xE5;nader p&amp;#xE5; ett nytt jobb d&amp;#xE4;r huvudprodukten &amp;#xE4;r byggd med detta ramverk har l&amp;#xE4;rt mig massor.&lt;/li&gt;
&lt;li&gt;Anv&amp;#xE4;nding av &lt;strong&gt;Ansible&lt;/strong&gt; och &lt;strong&gt;Terraform&lt;/strong&gt; visar m&amp;#xF6;jligheterna bortom bashscript.&lt;/li&gt;
&lt;li&gt;Tanken p&amp;#xE5; att b&amp;#xF6;rja anv&amp;#xE4;nda &lt;strong&gt;CSS Grid layout&lt;/strong&gt; &amp;#xE4;r inte riktigt lika ot&amp;#xE4;ck l&amp;#xE4;ngre.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Elixir&lt;/strong&gt; och &lt;strong&gt;Phoenix&lt;/strong&gt; var mycket utmanande l&amp;#xE5;ngt utanf&amp;#xF6;r komfortzonen.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;React&lt;/strong&gt; och &lt;strong&gt;Webpack&lt;/strong&gt;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id="linux"&gt;Linux&lt;a class="anchor" href="#linux"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;&lt;a href="/b/no-sysop/"&gt;Jag vill vara kreat&amp;#xF6;r, inte Sysadmin&lt;/a&gt;. P&amp;#xE5; Jobbet har jag k&amp;#xF6;rt &lt;strong&gt;Elementary Loki&lt;/strong&gt; i nio m&amp;#xE5;nader, men det ska ers&amp;#xE4;ttas med min favorit &lt;strong&gt;Arch linux&lt;/strong&gt; efter &amp;#xE5;rsskiftet.&lt;/p&gt;
&lt;p&gt;Hemmavid k&amp;#xF6;r jag numera Windows 10, som &amp;#xE4;r ett bedr&amp;#xF6;vligt och hemskt operativsystem.&lt;/p&gt;
&lt;h2 id="dota-2"&gt;Dota 2&lt;a class="anchor" href="#dota-2"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;Genom hela 2017 spelade jag Dota 2 sporadiskt. De typiska &lt;a href="/dota2"&gt;uppf&amp;#xF6;ljningsposterna&lt;/a&gt; har uteblivit d&amp;#xE5; jag bara spelar f&amp;#xF6;r att det &amp;#xE4;r kul numera, utan n&amp;#xE5;gra m&amp;#xE5;l med mitt spelande.&lt;/p&gt;
&lt;p&gt;Jag f&amp;#xF6;rlorade fler matcher &amp;#xE4;n jag vann, enligt mitt tidigare spelm&amp;#xF6;nster. Jag fokuserade p&amp;#xE5; att spela position 4-5 och fick slutligen upp &lt;strong&gt;Omniknight&lt;/strong&gt; som min mest spelade hj&amp;#xE4;lte.&lt;/p&gt;
&lt;p&gt;Dota 2 har under &amp;#xE5;ret f&amp;#xE5;tt n&amp;#xE5;gra rej&amp;#xE4;lt feta patchar som f&amp;#xF6;r&amp;#xE4;ndrat hela spelet flera g&amp;#xE5;nger, samt ett par nya hj&amp;#xE4;ltar.&lt;/p&gt;
&lt;h2 id="afk"&gt;AFK&lt;a class="anchor" href="#afk"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;I februari jobbade jag min sista m&amp;#xE5;nad som systemutvecklare p&amp;#xE5; &lt;strong&gt;Adeprimo i &amp;#xD6;stersund&lt;/strong&gt;, och i mars b&amp;#xF6;rjade jag som utvecklare p&amp;#xE5; &lt;strong&gt;Kundo i Stockholm&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;Initiellt jobbpendlade jag i b&amp;#xF6;rjan av veckorna, och k&amp;#xF6;rde de sista dagarna i veckan hemifr&amp;#xE5;n.&lt;/p&gt;
&lt;p&gt;I maj flyttade jag till G&amp;#xE4;vle f&amp;#xF6;r att f&amp;#xE5; n&amp;#xE4;rmare hem till min brorson, och f&amp;#xF6;r att underl&amp;#xE4;tta resandet till Stockholm.&lt;/p&gt;
&lt;p&gt;Jag styrketr&amp;#xE4;nade baslyft hela &amp;#xE5;ret. I juni sprang jag &lt;strong&gt;Blodomloppet&lt;/strong&gt;. Jag sprang inte milen detta &amp;#xE5;r.&lt;/p&gt;
&lt;h2 id="musik"&gt;Musik&lt;a class="anchor" href="#musik"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;H&amp;#xE4;gran&lt;/strong&gt; avslutades, nytt material skrevs och spelades in. &lt;strong&gt;6 nya sp&amp;#xE5;r&lt;/strong&gt; laddades upp p&amp;#xE5; SoundCloud.&lt;/p&gt;
&lt;p&gt;Jag bes&amp;#xF6;kte &lt;strong&gt;Gefle Metal Festival&lt;/strong&gt; och &lt;strong&gt;House of Metal&lt;/strong&gt;, samt &amp;#xE5;kte &lt;strong&gt;Close-Up b&amp;#xE5;ten 21&lt;/strong&gt;. Mellan dessa gick jag p&amp;#xE5; &lt;strong&gt;12&lt;/strong&gt; konserter i G&amp;#xE4;vle, Sundsvall och Stockholm, d&amp;#xE4;r &lt;strong&gt;Tredingsriten&lt;/strong&gt; (Grift, No&amp;#xEA;ta och Forndom) p&amp;#xE5; Medelplana bygdeg&amp;#xE5;rd var den mest spektakul&amp;#xE4;ra.&lt;/p&gt;
&lt;p&gt;Mina favoritalbum under &amp;#xE5;ret:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;em&gt;Mareridt&lt;/em&gt; av &lt;strong&gt;Myrkur&lt;/strong&gt;  &lt;br&gt;
En skiva jag v&amp;#xE4;ntade hela &amp;#xE5;ret p&amp;#xE5; och var snabb med att f&amp;#xF6;rbest&amp;#xE4;lla. Den &amp;#xF6;vertr&amp;#xE4;ffade alla f&amp;#xF6;rv&amp;#xE4;ntningar.&lt;/li&gt;
&lt;li&gt;&lt;em&gt;The End is Nigh&lt;/em&gt; av &lt;strong&gt;Apocalypse Orchestra&lt;/strong&gt;  &lt;br&gt;
S&amp;#xE5; h&amp;#xE4;r bra har inte s&amp;#xE4;ckpipor, nyckelharpor och distad barytongitarr l&amp;#xE5;tit sedan &lt;strong&gt;Lumsk&lt;/strong&gt;.&lt;/li&gt;
&lt;li&gt;&lt;em&gt;Stellar&lt;/em&gt; av &lt;strong&gt;Der Weg Einer Freiheit&lt;/strong&gt;  &lt;br&gt;
Min favoritskiva ur &amp;#xE5;rets sk&amp;#xF6;rd fr&amp;#xE5;n &lt;strong&gt;Metalhead box&lt;/strong&gt;.&lt;/li&gt;
&lt;li&gt;&lt;em&gt;&amp;#xD6;delagt&lt;/em&gt; av &lt;strong&gt;Domg&amp;#xE5;rd&lt;/strong&gt;  &lt;br&gt;
V&amp;#xE4;lskrivet, anrikt och arvshedrande. P&amp;#xE5; riktigt.&lt;/li&gt;
&lt;li&gt;&lt;em&gt;Dra sad&lt;/em&gt; av &lt;strong&gt;Elffor&lt;/strong&gt;  &lt;br&gt;
Minimalistisk skiva som g&amp;#xE5;r tillbaka till hur Elffor l&amp;#xE4;t p&amp;#xE5; &lt;em&gt;Son of the Shades&lt;/em&gt; och &lt;em&gt;Into the Dark Forest ...&lt;/em&gt;, h&amp;#xF6;gst ov&amp;#xE4;ntat men riktigt bra.&lt;/li&gt;
&lt;li&gt;&lt;em&gt;Ulfven&lt;/em&gt; av &lt;strong&gt;Ereb Altor&lt;/strong&gt;  &lt;br&gt;
Mycket publikfriar-l&amp;#xE5;tar p&amp;#xE5; denna. V&amp;#xE4;rdigt arv till &lt;strong&gt;Bathory&lt;/strong&gt;.&lt;/li&gt;
&lt;li&gt;&lt;em&gt;Arvet&lt;/em&gt; av &lt;strong&gt;Grift&lt;/strong&gt;  &lt;br&gt;
&lt;strong&gt;Grift&lt;/strong&gt; t&amp;#xE4;mjer p&amp;#xE5; gr&amp;#xE4;nserna vad som ryms innanf&amp;#xF6;r ramarna av svensk Black Metal. Mycket v&amp;#xE4;rdig uppf&amp;#xF6;ljare till &lt;strong&gt;Syner&lt;/strong&gt;.&lt;/li&gt;
&lt;li&gt;&lt;em&gt;Berdreyminn&lt;/em&gt; av &lt;strong&gt;Solstafir&lt;/strong&gt;  &lt;br&gt;
Mysig skiva fr&amp;#xE5;n ett band jag hade mycket liten koll p&amp;#xE5; innan.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id="lsta-bcker"&gt;L&amp;#xE4;sta b&amp;#xF6;cker&lt;a class="anchor" href="#lsta-bcker"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Get ready for the new CSS layout&lt;/strong&gt; (Rachel Andrew)&lt;br&gt;
Flexbox, grids och n&amp;#xE5;gra nya CSS properties som kommer att pensionera floats och avancerade hack med Media queries p&amp;#xE5; sikt.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Programming Elixir&lt;/strong&gt; (Dave Thomas)&lt;br&gt;
Funktionell programmering &amp;#xE4;r rej&amp;#xE4;lt l&amp;#xE5;ngt borta fr&amp;#xE5;n min komfortzon.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Programming Phoenix&lt;/strong&gt; (McCord, Tate, Valim)&lt;br&gt;
Den egentliga orsaken till att jag ens sneglar &amp;#xE5;t Elixir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Practical SVG&lt;/strong&gt; (Chris Coyier)&lt;br&gt;
Vektorgrafik &amp;#xE4;r h&amp;#xE4;r f&amp;#xF6;r att stanna.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Lord of the Rings&lt;/strong&gt; (J.R.R. Tolkien)&lt;br&gt;
Tillbaka till ursprunget: en av de viktigaste b&amp;#xF6;ckerna i mitt liv, p&amp;#xE5; originalspr&amp;#xE5;ket.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Assassin&amp;apos;s Quest&lt;/strong&gt; och &lt;strong&gt;Assassin&amp;apos;s Fate&lt;/strong&gt; (Robin Hobb)&lt;br&gt;
Det definitiva slutet f&amp;#xF6;r FitzChivalry Farseer och Fool/Amber, med en m&amp;#xF6;te av Liveship traders. Det var inte ov&amp;#xE4;rdigt, men jag hade inte klagat om &lt;strong&gt;Tawny man&lt;/strong&gt; (*I am content.&amp;quot;) f&amp;#xF6;rblivit det sista som ber&amp;#xE4;ttades om Fitz.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;The Colour of Magick&lt;/strong&gt; och &lt;strong&gt;The Light Fantastic&lt;/strong&gt; (Terry Pratchett)&lt;br&gt;
L&amp;#xE4;ttsam l&amp;#xE4;sning.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;The Satanic Bible&lt;/strong&gt; (Anton Szandor LaVey)&lt;br&gt;
En &amp;#xE5;terf&amp;#xF6;rening! Denna bok var h&amp;#xE4;ftigare n&amp;#xE4;r en var ton&amp;#xE5;ring &amp;#xE4;n vad den &amp;#xE4;r nu.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id="2018"&gt;2018&lt;a class="anchor" href="#2018"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;Jag ska vara &amp;#xC5;rskortskund p&amp;#xE5; SJ under ett &amp;#xE5;r som yrkesverksam i Stockholm.&lt;/p&gt;
&lt;p&gt;Jag kommer att bes&amp;#xF6;ka kultfestivalen &lt;strong&gt;Sweden Rock Festival&lt;/strong&gt;, andra tappningen av &lt;strong&gt;Stockholm Slaughter&lt;/strong&gt;, &amp;#xE4;nnu en &lt;strong&gt;House of Metal&lt;/strong&gt;, sj&amp;#xE4;lvfallet &lt;strong&gt;Gefle Metal Festival&lt;/strong&gt;, samt se Tyskland genom att &amp;#xE5;ka till &lt;strong&gt;Wacken Open Air&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;Jag kommer att forts&amp;#xE4;tta att spela Dota 2 f&amp;#xF6;r att det &amp;#xE4;r kul.&lt;/p&gt;
&lt;p&gt;En demo med experiment av &lt;strong&gt;blastbeats&lt;/strong&gt; i tretakt, tremolo picking och HM-2-ljud ska vara klar under n&amp;#xE4;sta &amp;#xE5;r.&lt;/p&gt;
&lt;p&gt;Fortsatt fokus p&amp;#xE5; h&amp;#xE4;lsa: mer tr&amp;#xE4;ning, mindre skitmat.&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>When Women Stopped Coding →</title>
    <id>https://madr.se/2017/when-women-stopped-coding</id>
    <link href="https://madr.se/2017/when-women-stopped-coding"/>
    <updated>2017-09-17T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;&lt;em&gt;F&amp;#xF6;ljande text &amp;#xE4;r kopierad fr&amp;#xE5;n ett inl&amp;#xE4;gg p&amp;#xE5; Facebook. Det &amp;#xE4;r borttaget d&amp;#xE4;r, men sparat h&amp;#xE4;r f&amp;#xF6;r referens.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Jag kan verkligen k&amp;#xE4;nna magnituden i &lt;a href="https://www.facebook.com/amightygirl/photos/a.360833590619627/1433083900061252/?type=3&amp;amp;theater"&gt;Inl&amp;#xE4;gget av A Mighty Girl&lt;/a&gt; om Podd-avsnittet &lt;a href="https://www.npr.org/sections/money/2014/10/17/356944145/episode-576-when-women-stopped-coding?fbclid=IwAR3uggflsBRAu6s_hJw3kInbSBPwCLibRm34wHOVW6OZQcoCCQHZBgli08c&amp;amp;t=1550419003163"&gt;When Women Stopped Coding&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Det h&amp;#xE4;r &amp;#xE4;r en av de sorgligaste sakerna som h&amp;#xE4;nt i efterkrigstid. Bara f&amp;#xF6;r att ge litet exempel p&amp;#xE5; hur det var f&amp;#xF6;re 1984 vill jag n&amp;#xE4;mna tv&amp;#xE5; kvinnor vars kod verkligen &amp;#xE4;r historisk.&lt;/p&gt;
&lt;p&gt;F&amp;#xF6;rst har vi &lt;a href="https://sv.wikipedia.org/wiki/Grace_Hopper"&gt;Grave Hopper&lt;/a&gt; som s&amp;#xE5;g till att den f&amp;#xF6;rsta kompilatorn togs fram. En kompilator &amp;#xE4;r det som &amp;#xF6;vers&amp;#xE4;tter programmeringskod, som m&amp;#xE4;nniskor skriver och resonerar kring, till ettor och nollor som en dator f&amp;#xF6;rst&amp;#xE5;r. Det programmeringsspr&amp;#xE5;k hon introducerade till kompilatorn vidareutvecklades senare till COBOL, som fortfarande anv&amp;#xE4;nds i banker &amp;#xE4;n idag. Hon fick f&amp;#xF6;r detta smeknamnet &amp;quot;Mormor COBOL&amp;quot; och var &amp;#xE4;ven Officer i amerikanska flottan.&lt;/p&gt;
&lt;p&gt;Sedan &amp;#xE4;r det &lt;a href="https://sv.wikipedia.org/&amp;#x2026;/Margaret_Hamilton_(vetenskapsman)"&gt;Margaret Hamilton&lt;/a&gt;, som var ansvarig mjukvarudesigner och en av de fr&amp;#xE4;msta programmerarna till Apolloprogrammet p&amp;#xE5; NASA, bl a Apollo 11 som vi alla minns tog m&amp;#xE4;nniskan till m&amp;#xE5;nen. Det var n&amp;#xE5;gra incidenter p&amp;#xE5; den m&amp;#xE5;nf&amp;#xE4;rden som hade avbrutit m&amp;#xE5;nf&amp;#xE4;rden om det inte vore f&amp;#xF6;r Hamiltons f&amp;#xF6;rm&amp;#xE5;ga f&amp;#xF6;r probleml&amp;#xF6;sning.&lt;/p&gt;
&lt;p&gt;Det &amp;#xE4;r f&amp;#xF6;rkastligt att vi p&amp;#xE5; 1980-talet best&amp;#xE4;mde oss f&amp;#xF6;r att inpr&amp;#xE4;nta i tjejer att datorer bara &amp;#xE4;r f&amp;#xF6;r pojkar. Det g&amp;#xF6;r att det idag, tre &amp;#xE5;rtionden senare, fortfarande &amp;#xE4;r alldeles f&amp;#xF6;r sv&amp;#xE5;rt f&amp;#xF6;r flickor/tjejer att b&amp;#xF6;rja programmera (det g&amp;#xF6;r man som barn eller ton&amp;#xE5;ring) och f&amp;#xF6;r kvinnor att g&amp;#xF6;ra karri&amp;#xE4;r inom IT.&lt;/p&gt;
&lt;p&gt;Vi beh&amp;#xF6;ver jobba med det h&amp;#xE4;r, s&amp;#xE4;rskilt genom att visa v&amp;#xE5;rt st&amp;#xF6;d f&amp;#xF6;r d&amp;#xF6;ttrar, systrar, sv&amp;#xE4;gerskor och till och med mammor. Ber&amp;#xE4;tta f&amp;#xF6;r dem att de kan, de KAN!&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>Ut med det gamla, in med det nya</title>
    <id>https://madr.se/2017/2017-mid</id>
    <link href="https://madr.se/2017/2017-mid"/>
    <updated>2017-07-30T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;2017 &amp;#xE4;r ett &amp;#xE5;r i r&amp;#xF6;relse. Hitills i &amp;#xE5;r har jag flyttat hem till G&amp;#xE4;vleborg fr&amp;#xE5;n J&amp;#xE4;mtland och avslutat mina 10 &amp;#xE5;r som konsult genom att ta anst&amp;#xE4;llning i Stockholm som utvecklare f&amp;#xF6;r digitala produkter inom kundservice.&lt;/p&gt;
&lt;p&gt;Den h&amp;#xE4;r typen av tillst&amp;#xE5;nd agerar ibland katalysator till beslut, och jag har beslutat att avsluta tv&amp;#xE5; l&amp;#xE5;ngvariga projekt.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;H&amp;#xE4;gran&lt;/strong&gt;, enmansbandet med inriktning mot experimentiell Doom Metal, blir officiellt bordslagt p&amp;#xE5; obest&amp;#xE4;md tid efter 9 &amp;#xE5;r utan nytt material. Utgett material kommer att laddas upp p&amp;#xE5; Youtube och Soundcloud.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Tajm&lt;/strong&gt;, ett f&amp;#xF6;rs&amp;#xF6;k att stilla frustration &amp;#xF6;ver att tidrapportering suger, har sl&amp;#xE4;ppts under BSD-licens p&amp;#xE5; Github. De servrar jag har f&amp;#xF6;r tj&amp;#xE4;nsten kommer att st&amp;#xE4;ngas ner i h&amp;#xF6;st.&lt;/p&gt;
&lt;h2 id="nsta-projekt"&gt;N&amp;#xE4;sta projekt&lt;a class="anchor" href="#nsta-projekt"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;Ett &amp;#xE4;nnu od&amp;#xF6;pt musikprojekt, under arbetsnamnet &lt;strong&gt;Umg&amp;#xE4;llt&lt;/strong&gt;, &amp;#xE4;r aktivt och kommer att p&amp;#xE5;b&amp;#xF6;rja inspelning av musik sent i h&amp;#xF6;st eller under vintern.&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>2016, året som gick</title>
    <id>https://madr.se/2016/2016</id>
    <link href="https://madr.se/2016/2016"/>
    <updated>2016-12-31T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;&amp;#xC4;nnu ett &amp;#xE5;r &amp;#xE4;r avslutat, varvid det &amp;#xE4;r l&amp;#xE4;gligt att skriva litet om de 12 m&amp;#xE5;nader som g&amp;#xE5;tt.&lt;/p&gt;
&lt;h2 id="tekniker-jag-lskat-under-ret"&gt;Tekniker jag &amp;#xE4;lskat under &amp;#xE5;ret&lt;a class="anchor" href="#tekniker-jag-lskat-under-ret"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;2016 &amp;#xE4;r ett &amp;#xE5;r d&amp;#xE4;r jag trots en hel del hinder (mer om detta senare i inl&amp;#xE4;gget) programmerat mer &amp;#xE4;n jag gjort p&amp;#xE5; flera &amp;#xE5;r. Jag har under &amp;#xE5;ret fr&amp;#xE4;mst skrivit kod i backends f&amp;#xF6;r webb.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Django&lt;/strong&gt; bara v&amp;#xE4;xer, s&amp;#xE4;rskilt efter &amp;#xE5;rets nyhet att &lt;a href="https://www.djangoproject.com/weblog/2016/sep/09/channels-adopted-official-django-project/"&gt;Channels blir en del av Django-projektet&lt;/a&gt;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Flask&lt;/strong&gt; sl&amp;#xE4;ppte version 0.11 i april och forts&amp;#xE4;tter att vara relevant. Inget annat verktyg fick s&amp;#xE5; mycket tid som Flask fick 2016, d&amp;#xE5; jag tillbringade massor tid &amp;#xE5;t att nyutveckla och f&amp;#xF6;rvalta ett REST API med en egen Oauth2-implementation, skrivet i Flask.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Vue.js&lt;/strong&gt; blev utv&amp;#xE4;rderat, efter f&amp;#xF6;rra &amp;#xE5;rets uppt&amp;#xE4;cktsf&amp;#xE4;rder med React och Angular. Detta &amp;#xE4;r ett JavaScript-bibliotek helt i min smak! Inkludera ett script och s&amp;#xE4;tt ig&amp;#xE5;ng, ingen startstr&amp;#xE4;cka. F&amp;#xF6;r den som vill v&amp;#xE4;xa med ramverket finns massor med f&amp;#xF6;rdjupningar och intressanta koncept.&lt;/li&gt;
&lt;li&gt;&amp;#xC5;terkomsten av &lt;strong&gt;Twitter Bootstrap&lt;/strong&gt;. Mycket har h&amp;#xE4;nt med detta prototyp-verktyg sedan sist jag anv&amp;#xE4;nde det i dess barndom. H&amp;#xE4;rligt att se hur det mognat och blivit p&amp;#xE5;litligt.&lt;/li&gt;
&lt;li&gt;Jag slutf&amp;#xF6;rde min konvertering fr&amp;#xE5;n CSS floats till &lt;strong&gt;Flexbox&lt;/strong&gt;.&lt;/li&gt;
&lt;li&gt;Jag skrev min f&amp;#xF6;rsta app till &lt;strong&gt;Android&lt;/strong&gt;, och har en andra under p&amp;#xE5;g&amp;#xE5;ende utveckling. &lt;strong&gt;Java&lt;/strong&gt; &amp;#xE4;r inte lika l&amp;#xE4;skligt som det brukade vara. Jag kan verkligen g&amp;#xE5; i god f&amp;#xF6;r &lt;a href="https://www.udacity.com/course/android-developer-nanodegree-by-google--nd801"&gt;Udacity nanodegree&lt;/a&gt; f&amp;#xF6;r alla som vill kika p&amp;#xE5; Android.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Wordpress&lt;/strong&gt; utv&amp;#xE4;rderades p&amp;#xE5; djupet. Mitt ogillande fick &amp;#xE4;nnu mer vatten p&amp;#xE5; sin kvarn.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Med allt ovanst&amp;#xE5;ende sagt s&amp;#xE5; k&amp;#xE4;nner jag att &lt;strong&gt;ren gr&amp;#xE4;nssnittsutveckling f&amp;#xF6;r webb&lt;/strong&gt; &amp;#xE4;r alldeles f&amp;#xF6;r tr&amp;#xE5;kigt och ostimulerande, fr&amp;#xE4;mst p&amp;#xE5; grund av att webben som utvecklingsplattform &amp;#xE4;r f&amp;#xF6;r tids&amp;#xF6;dande f&amp;#xF6;r att b&amp;#xE4;ra frukt.&lt;/p&gt;
&lt;p&gt;F&amp;#xF6;r min del k&amp;#xE4;nns API:er, Service Workers och backends med Django/Flask f&amp;#xF6;r HTTP/PubSubHubbub mer intressant i dagsl&amp;#xE4;get. Det &amp;#xE4;r &amp;#xE5;t det h&amp;#xE5;llet jag vill g&amp;#xE5;.&lt;/p&gt;
&lt;h2 id="linux"&gt;Linux&lt;a class="anchor" href="#linux"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;&lt;a href="/b/no-sysop/"&gt;Jag vill vara kreat&amp;#xF6;r, inte Sysadmin&lt;/a&gt;. P&amp;#xE5; jobbet funkar Linux perfekt, men hemmavid har jag &amp;#xF6;vergett tanken p&amp;#xE5; Linux d&amp;#xE5; det kraftigt h&amp;#xE4;mmar mitt musikskapande. De program jag anv&amp;#xE4;nder finns inte p&amp;#xE5; plattformen.&lt;/p&gt;
&lt;p&gt;Av denna anledning avslutade jag &amp;#xE5;ret med att k&amp;#xF6;pa en &lt;strong&gt;Macbook Pro med Touch bar&lt;/strong&gt; med avsikt att g&amp;#xE5; all-in p&amp;#xE5; laptop igen. Min station&amp;#xE4;ra dator, som varit bootad i Windows 10 st&amp;#xF6;rre delen av &amp;#xE5;ret, kommer att ominstalleras och bli en hemserver med &lt;strong&gt;Debian&lt;/strong&gt; f&amp;#xF6;r f&amp;#xF6;ljande till&amp;#xE4;mpningar:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Steam in-home streaming&lt;/li&gt;
&lt;li&gt;&lt;a href="https://syncthing.net"&gt;SyncThing&lt;/a&gt; f&amp;#xF6;r backup av filer&lt;/li&gt;
&lt;li&gt;iTunes hemmadelning&lt;/li&gt;
&lt;li&gt;Vagrant + Virtualbox f&amp;#xF6;r virtuella maskiner att labba med&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.plex.tv"&gt;Plex Media Server&lt;/a&gt; f&amp;#xF6;r det egna musik- och filmbiblioteket.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id="dota-2"&gt;Dota 2&lt;a class="anchor" href="#dota-2"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;Jag h&amp;#xF6;ll l&amp;#xF6;ftet till mig sj&amp;#xE4;lv att spela mindre Dota 2 under 2016. Jag planerar inte att skruva upp n&amp;#xE5;got, men inte heller att helt sluta. Niv&amp;#xE5;n jag har nu fungerar och g&amp;#xF6;r att spelet &amp;#xE4;r roligt n&amp;#xE4;r jag v&amp;#xE4;l tar mig tiden. Regelbundna matcher att titta p&amp;#xE5;, sporadiska botmatcher och riktiga matcher enbart i ranked eller tillsammans med v&amp;#xE4;nner.&lt;/p&gt;
&lt;h2 id="afk"&gt;AFK&lt;a class="anchor" href="#afk"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;2016 blev sammanslaget ett b&amp;#xE4;ttre &amp;#xE5;r &amp;#xE4;n 2015. Men det &amp;#xE4;r ocks&amp;#xE5; till ett dyrt pris. Mellan april och augusti var jag &lt;strong&gt;deltidssjukskriven&lt;/strong&gt; och behandlades f&amp;#xF6;r &lt;strong&gt;utmattningssyndrom&lt;/strong&gt; och &lt;strong&gt;depression&lt;/strong&gt;. Det var jag sj&amp;#xE4;lv som tog initiativet att kolla upp de fel jag hade, som bestod av bl a f&amp;#xF6;ljande: minskad aptit, orolig s&amp;#xF6;mn, oerh&amp;#xF6;rt alarmerande koncentrationssv&amp;#xE5;righeter och en k&amp;#xE4;nsla av att ingenting n&amp;#xE5;gonsin blev bra.&lt;/p&gt;
&lt;p&gt;Det startades &amp;#xE4;ven en utredning f&amp;#xF6;r om jag har &lt;strong&gt;Bipol&amp;#xE4;r sjukdom&lt;/strong&gt;, d&amp;#xE4;r slutsatsen blev att s&amp;#xE5; ej var fallet.&lt;/p&gt;
&lt;p&gt;Min egen slutsats kring allt &amp;#xE4;r att privatlivet som varit slutligen hann ikapp mig och tvingade mig att stanna och h&amp;#xE4;mta andan. Det visade sig vara f&amp;#xF6;r en bra sak, n&amp;#xE4;r allt kommer omkring.&lt;/p&gt;
&lt;p&gt;G&amp;#xE4;llande min h&amp;#xE4;lsa har jag h&amp;#xE5;llit ig&amp;#xE5;ng kroppen och &amp;#xE4;gnat sista kvartalet &amp;#xE5;t att tekniktr&amp;#xE4;na bas&amp;#xF6;vningar inom styrketr&amp;#xE4;ning, med avsikt att gymma regelbundet n&amp;#xE4;rmsta tolv m&amp;#xE5;naderna. Jag sprang inte milen detta &amp;#xE5;r, men har f&amp;#xE5;tt tillbaka mycket r&amp;#xF6;rlighet i kroppen.&lt;/p&gt;
&lt;p&gt;2016 flyttade jag ut ur den stora bostadsr&amp;#xE4;tt jag blev ensamboende i under f&amp;#xF6;rg&amp;#xE5;ende &amp;#xE5;r. Jag bor nu i en hyresr&amp;#xE4;tt i ett nyproducerat omr&amp;#xE5;de i utkanten av &amp;#xD6;stersund, d&amp;#xE4;r jag trivs.&lt;/p&gt;
&lt;h2 id="musik"&gt;Musik&lt;a class="anchor" href="#musik"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;H&amp;#xE4;gran&lt;/strong&gt; slutf&amp;#xF6;rde nytt material f&amp;#xF6;r f&amp;#xF6;rsta g&amp;#xE5;ngen sedan 2008. &lt;em&gt;Arvet&lt;/em&gt; &amp;#xE4;r ett sp&amp;#xE5;r p&amp;#xE5; sju minuter, Doomigt och m&amp;#xF6;rkt i samma anda som &lt;em&gt;Imperium&lt;/em&gt; och &lt;em&gt;Vilseledd&lt;/em&gt;. &lt;a href="https://soundcloud.com/hagran/arvet"&gt;Lyssna p&amp;#xE5; SoundCloud&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Sessionen inneh&amp;#xE5;ller den tvekl&amp;#xF6;st b&amp;#xE4;sta inspelningen jag gjort av mig sj&amp;#xE4;lv p&amp;#xE5; s&amp;#xE5;ng. Detta beror b&amp;#xE5;de p&amp;#xE5; min egen musikaliska kapacitet, men ocks&amp;#xE5; p&amp;#xE5; att jag hade en f&amp;#xF6;rtr&amp;#xE4;ffligt bra mikrofon.&lt;/p&gt;
&lt;p&gt;Musiken &amp;#xE4;r en ledstj&amp;#xE4;rna i m&amp;#xF6;rkret och jag har som ambition att producera mer n&amp;#xE4;sta &amp;#xE5;r. Det jag gjorde helt r&amp;#xE4;tt i &amp;#xE5;r var att skapa f&amp;#xF6;ruts&amp;#xE4;ttningar f&amp;#xF6;r att bara greppa ett instrument och spela, utan press, med mycket lek.&lt;/p&gt;
&lt;h2 id="2017"&gt;2017&lt;a class="anchor" href="#2017"&gt;&amp;#xB6;&lt;/a&gt;&lt;/h2&gt;
&lt;p&gt;Jag vill under 2016 ta l&amp;#xE4;rdomarna fr&amp;#xE5;n Android f&amp;#xF6;r att utforska &lt;strong&gt;Swift&lt;/strong&gt; i  Apples ekosystem, genom att appar f&amp;#xF6;r AppleTV, Watch, iPhone och iPad. Jag vill bli en gr&amp;#xE4;nssnittsutvecklare &lt;strong&gt;p&amp;#xE5; riktigt&lt;/strong&gt;, och b&amp;#xF6;rja g&amp;#xE5; utanf&amp;#xF6;r den traditionella webbutvecklarrollen jag hittills f&amp;#xF6;rlitat mig p&amp;#xE5;. Id&amp;#xE9;erna finns, och tiden ocks&amp;#xE5; nu n&amp;#xE4;r jag spelar avsev&amp;#xE4;rt mindre Dota 2.&lt;/p&gt;
&lt;p&gt;Kanske blir 2017 det &amp;#xE5;r jag slutligen tar itu med GTK+ eller PyGObjects? Jag &amp;#xE4;r skeptisk, men &amp;#xE4;r inte beredd att helt sl&amp;#xE4;ppa id&amp;#xE9;n p&amp;#xE5; att skriva program till Linux.&lt;/p&gt;
&lt;p&gt;Eftersom C# nu &amp;#xE4;r p&amp;#xE5; v&amp;#xE4;g att bli n&amp;#xE5;got f&amp;#xF6;r oss utan Windows och  Visual Studio finns stora m&amp;#xF6;jligheter f&amp;#xF6;r att jag skriver litet kod i det programmeringsspr&amp;#xE5;ket igen.&lt;/p&gt;
&lt;p&gt;&amp;#xC4;nnu mer musik! Minst en till l&amp;#xE5;t med &lt;strong&gt;H&amp;#xE4;gran&lt;/strong&gt;.&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>Rants om Progressive Enhancement</title>
    <id>https://madr.se/2016/pe</id>
    <link href="https://madr.se/2016/pe"/>
    <updated>2016-12-15T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;I &lt;a href="https://www.viget.com/articles/the-case-against-progressive-enhancements-flimsy-moral-foundation"&gt;The Case Against Progressive Enhancement&amp;apos;s Flimsy Moral Foundation&lt;/a&gt; ifr&amp;#xE5;gas&amp;#xE4;tts den praktiska och faktiska nyttan med &lt;a href="https://en.wikipedia.org/wiki/Progressive_enhancement"&gt;Progressive Enhancement&lt;/a&gt;, en av de principer jag krampaktigt h&amp;#xE5;llit fast vid sedan l&amp;#xE5;ngt innan jag blev professionell webbutvecklare.&lt;/p&gt;
&lt;p&gt;Jag hittade den via en rant, &lt;a href="https://sonniesedge.co.uk/blog/progressive-enhancement"&gt;Yes, progressive enhancement is a fucking moral argument&lt;/a&gt; vars ton &amp;#xE4;r snarlik den ton jag hade haft om jag tagit mig tid att skriva n&amp;#xE5;got:&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Fundamentally, the article is a shitty strawman argument against PE. It erroneously states that PE proponents want the latest canvas-based in-browser game to work with JS turned off. Which is bollocks, because the argument for PE is developing useful apps and sites that achieve core functionality for everyone, no matter their browser, OS, hardware and user ableness, offering nice-to-haves as the abilities of those things increase. But no, the author has reduced it down to &amp;#x201C;PE hardliners want everything to work without JS&amp;#x201D;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;De &amp;#xE4;r l&amp;#xE4;sv&amp;#xE4;rda i sin helhet. Det jag personligen kommer att t&amp;#xE4;nka p&amp;#xE5; &amp;#xE4;r att t&amp;#xE4;nket inte &amp;#xE4;r nytt.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;N&amp;#xE4;r CSS b&amp;#xF6;rjade ta fart fanns det folk som f&amp;#xF6;rsvarade fortsatt anv&amp;#xE4;ndning av tabeller f&amp;#xF6;r layout, samt personer som anv&amp;#xE4;nde &lt;code&gt;divs and spans for layout&lt;/code&gt;.&lt;/li&gt;
&lt;li&gt;N&amp;#xE4;r IE var den enda webbl&amp;#xE4;saren fanns det personer som ans&amp;#xE5;g att alla andra webbl&amp;#xE4;sare inte r&amp;#xE4;knades, samt folk som tyckte att det var ok att st&amp;#xE4;nga folk med IE ute.&lt;/li&gt;
&lt;li&gt;N&amp;#xE4;r CSS3 b&amp;#xF6;rjade ta fart fanns personer som bara inkludera &lt;code&gt;-webkit-&lt;/code&gt; prefix, inte &lt;code&gt;-moz-&lt;/code&gt;, &lt;code&gt;-o-&lt;/code&gt; och &lt;code&gt;-ms-&lt;/code&gt;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Mentaliteten d&amp;#xE4;r verktygen &amp;#xE4;r viktigare &amp;#xE4;n aff&amp;#xE4;rsnytta &amp;#xE4;r inget nytt. Det &amp;#xE4;r l&amp;#xE4;tt att avf&amp;#xE4;rda Progressive Enhancement d&amp;#xE5; det trycker p&amp;#xE5; en &amp;#xF6;m punkt: att det finns ett g&amp;#xE4;ng enheter och scenarion som f&amp;#xF6;rvandlar str&amp;#xE5;lande vacker kod i Det &amp;#xC4;lskade JavaScript-ramverket(tm) till en ol&amp;#xE4;slig klump s&amp;#xF6;rja. Ignorance is bliss.&lt;/p&gt;
&lt;p&gt;Med detta sagt har &amp;#xE4;ven jag l&amp;#xE4;rt mig att kompromissa f&amp;#xF6;r aff&amp;#xE4;rs- och kundnytta &amp;#xE5;t b&amp;#xE5;da h&amp;#xE5;ll.&lt;/p&gt;
&lt;p&gt;Under mina 10 &amp;#xE5;r som konsult har inte en enda kund h&amp;#xF6;rt av sig g&amp;#xE4;llande problem relaterat till att JavaScript och CSS &amp;#xE4;r avslaget. Inte heller har n&amp;#xE5;gon h&amp;#xF6;rt av sig om att HTML-dokument inte &amp;#xE4;r tillg&amp;#xE4;ngliga eller semantiskt uppm&amp;#xE4;rkta.&lt;/p&gt;
&lt;p&gt;I de Google Analytics-rapporter jag baserar en m&amp;#xE5;nadsrapport p&amp;#xE5; f&amp;#xF6;r kunds r&amp;#xE4;kning anv&amp;#xE4;nds sajten enbart av Google Chrome och Safari f&amp;#xF6;r iOS, med mindre &amp;#xE4;n en halv procents anv&amp;#xE4;ndning f&amp;#xF6;r n&amp;#xE5;gon annan enhet eller webbl&amp;#xE4;sare.&lt;/p&gt;
&lt;p&gt;Med det sagt s&amp;#xE5; bygger jag alltid saker med Progressive Enhancement eftersom det var s&amp;#xE5; jag l&amp;#xE4;rde mig, men det &amp;#xE4;r inte l&amp;#xE4;ngre n&amp;#xE5;got jag tar f&amp;#xF6;r givet att se som ekvivalent till kund- och aff&amp;#xE4;rsnytta.&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>Less is More - omgörning(ar) av madr.se</title>
    <id>https://madr.se/2016/less-is-more</id>
    <link href="https://madr.se/2016/less-is-more"/>
    <updated>2016-11-17T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;F&amp;#xF6;r n&amp;#xE4;stan 1,5 &amp;#xE5;r sedan sm&amp;#xF6;g jag helt fr&amp;#xE4;ckt ut en ny design av den h&amp;#xE4;r hemsidan, d&amp;#xE4;r jag dessutom kastade ut Django utan minsta f&amp;#xF6;rvarning.&lt;/p&gt;
&lt;p&gt;Ska jag hitta p&amp;#xE5; en bra urs&amp;#xE4;kt s&amp;#xE5; var det fr&amp;#xE4;mst f&amp;#xF6;r att &lt;a href="https://blog.heroku.com/new-dyno-types-public-beta"&gt;Heroku inte l&amp;#xE4;ngre kan k&amp;#xF6;ras helt gratis&lt;/a&gt;. Men helt &amp;#xE4;rligt s&amp;#xE5; hade tanken p&amp;#xE5; att g&amp;#xE5; vidare fr&amp;#xE5;n Django funnits i mitt huvud ett tag redan.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Less is more&lt;/strong&gt;. Jag bloggar p&amp;#xE5; den h&amp;#xE4;r hemsidan r&amp;#xE4;tt sporadiskt. Jag anv&amp;#xE4;nder den inte f&amp;#xF6;r n&amp;#xE5;got s&amp;#xE4;rskilt, annat &amp;#xE4;n att blogga om s&amp;#xE5;nt jag tycker &amp;#xE4;r v&amp;#xE4;rt att kunna blicka tillbaka p&amp;#xE5; i retrospektiv, fr&amp;#xE4;mst f&amp;#xF6;r egen del.&lt;/p&gt;
&lt;p&gt;S&amp;#xE5; n&amp;#xE4;r jag snubblade &amp;#xF6;ver &lt;a href="http://metalsmith.io"&gt;MetalSmith&lt;/a&gt;, en modul&amp;#xE4;r och pluginbaserad variant p&amp;#xE5; generatorer f&amp;#xF6;r statiska hemsidor, blev jag genast inspirerad. P&amp;#xE5; n&amp;#xE5;gra kv&amp;#xE4;llar hade jag skrivit n&amp;#xE5;gra byggscript i Node.js och litet CSS, samt ett export-script i Django.&lt;/p&gt;
&lt;p&gt;Jag placerade de genererade HTML-filerna p&amp;#xE5; min egen VPS, och skj&amp;#xF6;t upp k&amp;#xE4;llkoden p&amp;#xE5; Github f&amp;#xF6;r att f&amp;#xE5; litet backup. N&amp;#xE5;gon m&amp;#xE5;nad senare skapade jag ocks&amp;#xE5; ett SSL-certifikat s&amp;#xE5; att sajten numera k&amp;#xF6;r &amp;#xF6;ver HTTPS. Detta skedde sommaren 2015.&lt;/p&gt;
&lt;p&gt;I och med detta inl&amp;#xE4;gg har jag piffat upp med litet ny CSS och litet uppst&amp;#xE4;dning bland gamla sidor. &amp;#xC5;terigen, &lt;strong&gt;less os more&lt;/strong&gt;: jag st&amp;#xE4;dade h&amp;#xE4;r bort JavaScript som inte anv&amp;#xE4;ndes, samt n&amp;#xE5;gra beroenden som inte l&amp;#xE4;ngre var aktuella i &lt;code&gt;package.json&lt;/code&gt;.&lt;/p&gt;
&lt;p&gt;Madr.se &amp;#xE4;r n&amp;#xE4;r allt kommer omkring det mest personliga jag har p&amp;#xE5; Internet. Jag &amp;#xE4;r ingen person som uppskattar verktyg som g&amp;#xE5;r i tr&amp;#xE4;da. S&amp;#xE5;nt som inte kommer till anv&amp;#xE4;ndning ska ut. Enkelt.&lt;/p&gt;
&lt;p&gt;Detta gjorde jag &amp;#xE4;ven med tanke p&amp;#xE5; att madr.se fyller 10 &amp;#xE5;r i slutet av december. Det &amp;#xE4;r utan t&amp;#xE4;vlan det l&amp;#xE4;ngsta jag givit en och samma sajt.&lt;/p&gt;
&lt;p&gt;Jag kommer troligtvis att till&amp;#xE5;ta mig att bli litet nostalgisk genom att skriva n&amp;#xE5;gra rader om de sajter jag drev innan n&amp;#xE4;r det s&amp;#xE5; &amp;#xE4;r dags att fira 10 &amp;#xE5;r med samma blogg. M&amp;#xE5;h&amp;#xE4;nda kikar jag tillbaka p&amp;#xE5; vem jag var d&amp;#xE5;, i december 2006.&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>Uppladdning inför Advent of Code 2016</title>
    <id>https://madr.se/2016/aoc-2016</id>
    <link href="https://madr.se/2016/aoc-2016"/>
    <updated>2016-11-17T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;Jag har under &amp;#xE5;ret skrivit mer kod &amp;#xE4;n p&amp;#xE5; m&amp;#xE5;nga tidigare &amp;#xE5;r, s&amp;#xE5; vad &amp;#xE4;r v&amp;#xE4;l mer passande &amp;#xE4;n att anv&amp;#xE4;nda formtoppen till n&amp;#xE5;got kul?&lt;/p&gt;
&lt;p&gt;&lt;a href="http://adventofcode.com"&gt;Advent of Code&lt;/a&gt; &amp;#xE4;r en adventskalender f&amp;#xF6;r programmerare. Varje dag 1-25 december sl&amp;#xE4;pps en nya uppgift som kan l&amp;#xF6;sas med valfritt programmeringsspr&amp;#xE5;k.  Det h&amp;#xF6;lls f&amp;#xF6;r f&amp;#xF6;rsta g&amp;#xE5;ngen 2015 och repriseras i &amp;#xE5;r.&lt;/p&gt;
&lt;p&gt;Jag deltog inte f&amp;#xF6;rra &amp;#xE5;ret men jag hade t&amp;#xE4;nkt ta revanch i &amp;#xE5;r genom att f&amp;#xF6;rs&amp;#xF6;ka slutf&amp;#xF6;ra hela kalendern med minst tv&amp;#xE5; programmeringsspr&amp;#xE5;k: ett f&amp;#xF6;r mig v&amp;#xE4;lbekant, och ett f&amp;#xF6;r mig obekant.&lt;/p&gt;
&lt;p&gt;Det v&amp;#xE4;lbekanta spr&amp;#xE5;ket &amp;#xE4;r ingen h&amp;#xF6;goddsare: &lt;strong&gt;Python 3&lt;/strong&gt;. Det &amp;#xE4;r sedan fyra &amp;#xE5;r mitt f&amp;#xF6;rstahandsval f&amp;#xF6;r att koda webbbackends och scripts, s&amp;#xE5; jag ser fram emot att f&amp;#xE5; prova Python p&amp;#xE5; ren probleml&amp;#xF6;snings-orienterad programmering.&lt;/p&gt;
&lt;p&gt;Det f&amp;#xF6;r mig obekanta spr&amp;#xE5;ket var litet tufft att v&amp;#xE4;lja ut, men landade till slut p&amp;#xE5; ett av de spr&amp;#xE5;k som fascinerar mig mest: &lt;strong&gt;Lisp&lt;/strong&gt;. H&amp;#xE4;r har jag &amp;#xE4;nnu inte valt dialekt, men jag har smalnat av till antingen &lt;strong&gt;Common Lisp&lt;/strong&gt; (d&amp;#xE5; Clozure Common Lisp) eller &lt;strong&gt;Scheme&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;D&amp;#xE5; Lisp &amp;#xE4;r mig totalt obekant kommer jag att tillbringa n&amp;#xE4;rmasta dagarna &amp;#xE5;t att l&amp;#xE4;sa p&amp;#xE5; litet och sedan v&amp;#xE4;lja dialekt baserat p&amp;#xE5; Minsta motst&amp;#xE5;ndets lag.&lt;/p&gt;
&lt;p&gt;Jag ska en g&amp;#xE5;ng f&amp;#xF6;r alla ifr&amp;#xE5;gas&amp;#xE4;tta myten om att JavaScript och Lisp har likheter, om s&amp;#xE5; bara f&amp;#xF6;r min egen skull.&lt;/p&gt;
&lt;p&gt;Jag har redan tjuvstartat genom att forka &lt;a href="https://gitub.com/madr/advent_of_code_2016"&gt;Kodsnacks repo p&amp;#xE5; Github&lt;/a&gt; f&amp;#xF6;r att kunna l&amp;#xE4;mna in l&amp;#xF6;sningarna i ett lokalt sammanhang, samt f&amp;#xF6;r att utmana mig sj&amp;#xE4;lv litet att versionshantera l&amp;#xF6;sningarna ordentligt.&lt;/p&gt;
</content>
  </entry>
  <entry>
    <title>Remember, remember ...</title>
    <id>https://madr.se/2016/5-nov</id>
    <link href="https://madr.se/2016/5-nov"/>
    <updated>2016-11-05T00:00:00.000Z</updated>
    <author>
      <name>Anders Ytterström</name>
      <email>yttan@fastmail.se</email>
    </author>
    <content>&lt;p&gt;Sammanfattar g&amp;#xE5;rdagen med att den i allra h&amp;#xF6;gsta grad &amp;#xE4;r v&amp;#xE4;rd att minnas.&lt;/p&gt;
&lt;p&gt;T&amp;#xE5;gresa genom ett H&amp;#xE4;lsingland med sn&amp;#xF6;t&amp;#xE4;ckta skogar, den &amp;#xE5;rliga visningen av V f&amp;#xF6;r
Vendetta, en h&amp;#xE4;rlig promenad tv&amp;#xE4;rs &amp;#xF6;ver S&amp;#xF6;der, det spontana m&amp;#xF6;tet med Myrkur p&amp;#xE5; hotellet,
samt spelning med Opeth vars setlist var oerh&amp;#xF6;rt bra, med Myrkur som f&amp;#xF6;rband: dessa &amp;#xE4;r de
orsaker till att jag kommer att minnas 5 november fr&amp;#xE5;n detta &amp;#xE5;r.&lt;/p&gt;
</content>
  </entry>
</feed>