<p>De senaste m&#xE5;naderna har jag n&#xE5;gra g&#xE5;nger hamnat i situationer som f&#xE5;tt mig att fundera. Situationer d&#xE4;r jag f&#xF6;rv&#xE4;ntas kunna svara p&#xE5; varf&#xF6;r jag twittrar. Situationer d&#xE4;r den jag talar med k&#xE4;nner sig utmattad p&#xE5; grund av sin digitala identitets h&#xE4;mmande effekt p&#xE5; det egna jaget. Situationer d&#xE4;r personer jag talar med hyllar facebook och d&#xF6;mer mycket annat. Situationer d&#xE4;r personen inte vill finnas p&#xE5; facebook, av olika principer eller sk&#xE4;l.</p><p>Jag har &#xE4;ven blivit ledsen och besviken p&#xE5; personer jag k&#xE4;nner och bryr mig om n&#xE5;gra g&#xE5;nger, d&#xE4;r det p&#xE5; ett rent filosofiskt plan finns paralleller.</p><h2 id=min-ntidentitet>Min n&#xE4;tidentitet<a class=anchor href=#min-ntidentitet>&#xB6;</a></h2><p>Min relation till Internet str&#xE4;cker sig bortom mitt dagliga arbete som gr&#xE4;nssnittsutvecklare f&#xF6;r en webbyr&#xE5;. Internet &#xE4;r f&#xF6;r mig n&#xE5;got mycket st&#xF6;rre &#xE4;n surfande, mejlande och chattande. Genom att jag l&#xE4;mnar digitala avtryck litet var stans skapar jag n&#xE5;got sammanh&#xE4;ngande, konsekvent och igenk&#xE4;nnbart. Min ton i text, mitt alias, min e-postadress och min anv&#xE4;ndarbild &#xE4;r konsekventa och skapar det som &#xE4;r min n&#xE4;tidentitet.</p><p>Min n&#xE4;tidentitet har ett annat socialt beteende &#xE4;n mitt egna jag som bygger p&#xE5; relevans i sakfr&#xE5;gor och fokus p&#xE5; inneh&#xE5;ll snarare &#xE4;n personkemi.</p><p>P&#xE5; Anobii bryr jag mig bara om personer som l&#xE4;ser och recenserar intressanta b&#xF6;cker. P&#xE5; Last.fm bryr jag mig bara om en persons musiksmak och historik, inte deras person. P&#xE5; twitter f&#xF6;ljer jag personer som rapporterar om saker jag bryr mig om, snarare &#xE4;n f&#xF6;r att jag &quot;k&#xE4;nner dem&quot; (av min 94 following har jag tr&#xE4;ffat f&#xE4;rre &#xE4;n 20, och ingen av dessa finns i min telefonbok).</p><p>Ovan &#xE4;r bara ett axplock av alla tj&#xE4;nster som definierar min n&#xE4;tidentitet. Vad alla tj&#xE4;nster har gemensamt &#xE4;r dock fokus p&#xE5; inneh&#xE5;ll och relevans, ocks&#xE5; fr&#xE5;n det jag sj&#xE4;lv skriver om.</p><ul><li>Jag twittrar &#xF6;vergripande bara utifr&#xE5;n min yrkesrolls perspektiv, med undantag.</li><li>Jag talar inte om bra b&#xF6;cker med mina v&#xE4;nner p&#xE5; last.fm.</li><li>Jag pratar inte om v&#xE4;dret med personer som har lika b&#xF6;cker som mig p&#xE5; Anobii.</li><li>Jag &#xE4;r inte i huvudsak inte intresserad av att tr&#xE4;ffa personer &quot;p&#xE5; n&#xE4;tet&quot; i det verkliga livet.</li></ul><h2 id=mitt-egna-jag>Mitt egna jag<a class=anchor href=#mitt-egna-jag>&#xB6;</a></h2><p>Anders bor i &#xD6;stersund och har f&#xF6;rutom n&#xE5;gra gamla musik-kamrater ocks&#xE5; gamla klasskamrater fr&#xE5;n S&#xF6;derhamn, gamla grannar i V&#xE5;gbro och p&#xE5; Sidsj&#xF6;v&#xE4;gen och gamla samstudenter fr&#xE5;n Mittuniversitetet. Alla dessa har tr&#xE4;ffat mig personligen och vet hur jag skrattar, sk&#xE4;mtar, deltar och uttrycker mig.</p><p>N&#xE5;gra tr&#xE4;ffar jag ibland f&#xF6;r att umg&#xE5;s. Jag h&#xE5;ller kontakt i varierande niv&#xE5;er. N&#xE5;gra bryr jag mig uppriktigt om. De personer som inte bor l&#xE5;ngt bort har jag i min IM och i min telefonbok.</p><h2 id=skillnaden>Skillnaden<a class=anchor href=#skillnaden>&#xB6;</a></h2><p>S&#xE5; har dessa n&#xE5;got med min n&#xE4;tidentitet att g&#xF6;ra? Nej, det &#xE4;r av ringa betydelse. De definierar mitt egna jag och min person, inte vem jag &#xE4;r p&#xE5; n&#xE4;tet. Faktum &#xE4;r att jag, p&#xE5; grund av min n&#xE4;tidentitet, v&#xE4;rdes&#xE4;tter mitt egna jags kontakter n&#xE5;got oerh&#xF6;rt eftersom de st&#xE5;r mig s&#xE5; oerh&#xF6;rt mycket n&#xE4;rmare. P&#xE5; grund av mitt anv&#xE4;ndande av Internet som in- och utkanal blir mina kontakter med dessa personer mycket s&#xE4;rskilda och intima i j&#xE4;mf&#xF6;relse.</p><p>N&#xE5;gra p&#xE5;tagliga skillnader, n&#xE4;r jag &#xE4;r p&#xE5; jobbet eller p&#xE5; stan:</p><ul><li><p>Tilltalar jag n&#xE5;gon p&#xE5; last.fm, twitter eller anobii, f&#xF6;rv&#xE4;ntar jag mig inte ett svar genast. Lika v&#xE4;l som att jag inte k&#xE4;nner mig tvungen att besvara n&#xE5;gon som tilltalar mig genast. Konversationer &#xE4;r villkorsl&#xF6;sa och p&#xE5; mycket fria villkor, vilket g&#xF6;r att jag kan delta n&#xE4;r jag vill och inte beh&#xF6;ver bli st&#xF6;rd med n&#xE5;got jag tycker &#xE4;r viktigare.</p></li><li><p>N&#xE4;r n&#xE5;gon ringer, s&#xE4;ger n&#xE5;got p&#xE5; IM eller skickar mig ett SMS l&#xE4;gger jag det jag har i h&#xE4;nderna &#xE5;t sidan eller ber att f&#xE5; &#xE5;terkomma om en stund. Det &#xE4;r ju viktigt. Personen som h&#xF6;r av sig &#xE4;r n&#xE5;gon jag bryr mig om och d&#xE5; vill jag sj&#xE4;lvklart veta vad de vill.</p></li></ul><p>Med den h&#xE4;r skillnaden i tankarna menar jag att Facebook h&#xE4;mmar mitt egna jags relationer.</p><p>Facebook &#xE4;r n&#xE4;mligen <a href=http://fibban.fleecelabs.se/2008/04/drfr-tror-jag-i.html title="Fibrer: D&#xE4;rf&#xF6;r tror jag inte p&#xE5; facebook">ett speciellt fall</a> d&#xE4;r n&#xE4;tidentiteten och det egna jaget pl&#xF6;tsligt ska vara en och samma identitet. Man anv&#xE4;nder ett foto p&#xE5; sig sj&#xE4;lv och sitt riktiga namn, och l&#xE4;gger till personer man &quot;k&#xE4;nner&quot; snarare &#xE4;n personer med bra utbyte. Din identitet bygger p&#xE5; v&#xE4;nner och v&#xE4;nners v&#xE4;nner, inte vad du tillf&#xF6;r i sak. Jag &#xE4;r inte ett undantag: bland mina v&#xE4;nner p&#xE5; Facebook finns enbart personer som tr&#xE4;ffat mig personligen eller &#xE5;tminstone k&#xE4;nner mig mycket v&#xE4;l.</p><p>I en inte allt f&#xF6;r avl&#xE4;gsen d&#xE5;tid blev det pl&#xF6;tsligt fullt legitimt att sluta h&#xE5;lla kontakten via m&#xF6;ten, IM och telefon och ist&#xE4;llet anv&#xE4;nda Facebook som plattform.</p><p>Utifr&#xE5;n mitt perspektiv &#xE4;r detta detsamma som att flytta h&#xF6;gst personliga och intima saker ut till ett opersonligt forum - en sida p&#xE5; Internet.</p><p>Jag n&#xE4;mnde ovan att det finns situationer som f&#xE5;r mig att reagera. H&#xE4;r &#xE4;r n&#xE5;gra exempel:</p><ul><li><p>En v&#xE4;n skaffade flickv&#xE4;n samtidigt som jag blev ihop med min nuvarande flickv&#xE4;n, i b&#xE5;da fallen handlade det om distansf&#xF6;rh&#xE5;llanden. Vi delade d&#xE4;rf&#xF6;r en hel del k&#xE4;nslor en l&#xE5;ng period. F&#xF6;r en tid sedan f&#xF6;rlovade de sig och ber&#xE4;ttade det p&#xE5; Facebook men inte till mig personligen.</p></li><li><p>En gammal klasskamrats pappa tog livet av sig. Min klasskamrat skrev om h&#xE4;ndelsen i sin logg p&#xE5; Facebook. Vad f&#xF6;rv&#xE4;ntas jag egentligen svara p&#xE5; det? Och om jag verkligen bryr mig, borde jag inte g&#xF6;ra mer &#xE4;n att skriva ett offentligt meddelande p&#xE5; en sida p&#xE5; Internet?</p></li><li><p>N&#xE4;r jag fyllde &#xE5;r fick jag gratulationer via Facebook, men inte alls via telefon eller grattiskort. Jag vet ocks&#xE5; med mig att h&#xE4;lften av gratulationerna kom utav p&#xE5;minnelsefunktionen, inte gott minne.</p></li></ul><h2 id=facebook-hmmar-relationer>Facebook h&#xE4;mmar relationer<a class=anchor href=#facebook-hmmar-relationer>&#xB6;</a></h2><p>Min po&#xE4;ng &#xE4;r att folk tycks sluta v&#xE5;rda sina v&#xE4;nskapsrelationer, trivialisera dem genom att lyfta ut all kommunikation till en opersonlig plattform. Man ringer inte, SMS:ar inte, pratar inte &#xF6;ga mot &#xF6;ga.</p><p>Sj&#xE4;lvklart h&#xE4;nde det h&#xE4;r &#xE4;ven innan Facebook, men MySpace och Lunarstorm som exempel. Men ingen av dessa hade s&#xE5; omfattande omv&#xE4;ndning p&#xE5; s&#xE5; m&#xE5;nga, i olika &#xE5;ldrar och olika grupper.</p><p>Att skriva p&#xE5; en Facebook-wall &#xE4;r inte detsamma som att sms:a. Att skicka ett meddelande p&#xE5; Facebook &#xE4;r inte likst&#xE4;llt med att ringa. Att skriva en kommentar n&#xE4;r n&#xE5;got roligt eller sorgligt har h&#xE4;nt &#xE4;r inte detsamma som att s&#xE4;ga det direkt till personen. Och har man n&#xE5;got viktigt att ber&#xE4;tta &#xE4;r inte Facebook en f&#xF6;rdragen plattform.</p><p>Och i slut&#xE4;ndan &#xE4;r n&#xE4;tidentiteten aldrig samma sak som det egna jaget.</p>